{"duration": 0.045961856842041016, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: EBV-associated recurrent Hodgkin's disease after renal transplantation. ABSTRACT: Hodgkin's disease is recognized as part of the spectrum of post-transplantation lymphoproliferative disorders (PTLD), although it is still an uncommon de novo malignancy in this population. Epstein-Barr virus (EBV) has been linked to both post-transplant non-Hodgkin's lymphomas and Hodgkin's disease. We report a case of recurrent Hodgkin's disease in a patient who received a renal transplant in childhood and later developed EBV-associated Hodgkin's disease with remission after chemotherapy until subsequent relapse 9 years later that was successfully treated. To our knowledge, this is the first report of recurrent Hodgkin's disease in a transplant recipient. We briefly discuss the pathogenesis of and risk factors for EBV-related PTLD, utility of EBV load surveillance, and the options for treatment of PTLD including immunosuppression reduction, antiviral therapy, anti-CD20 monoclonal antibodies, cytotoxic T cells, and the possible roles of interferon-alpha and rapamycin. TEXT: Case report The patient is a 27-year-old white man who received a living-related donor transplant from his father at 11 years of age in 1986 for end stage renal disease secondary to posterior urethral valves. The patient was seronegative for cytomegalovirus (CMV) and Epstein–Barr virus (EBV) prior to transplantation. His father's EBV and CMV status were unavailable. The transplant course was complicated by immediate postoperative acute renal artery thrombosis, which required transplant nephrectomy. He then received a deceased donor renal transplant 10 days later. Maintenance immunosuppression consisted of cyclosporine (Sandimmune formulation), azathioprine, and prednisone. He received 12 doses of Minnesota equine antilymphocyte immunoglobulin (MALG) for induction followed by 10 doses of murine anti-CD3 monoclonal antibody (OKT3) for two episodes of acute graft rejection over the 7 weeks following the transplant. The deceased donor's EBV and CMV status were unavailable from medical records. The patient developed acute infectious mononucleosis 2 months after transplantation demonstrated by positive EBV serology. He was treated with acyclovir and the infectious mononucleosis resolved. At the age of 18, he presented with 5 months of fever, weight-loss and night sweats, and was found to have axillary adenopathy, splenomegaly and bulky right mediastinal adenopathy. A right anterior, thoracotomy and lymph node biopsy demonstrated Hodgkin's disease, nodular sclerosing subtype. Hodgkin's–Reed–Sternberg (HRS) cells were strongly positive for CD30 and EBV-latent membrane protein (LMP)-1. He was staged as Hodgkin's disease-IIIB. His EBV serology demonstrated elevated antiviral capsid antigen (VCA) IgG titers and positive anti-VCA IgM, consistent with reactivation of EBV infection.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596514.911911}