{"duration": 0.021437406539916992, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': 'Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let\\'s think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let\\'s think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Impact of COVID-19 Outbreak on Cancer Patient Care and Treatment: Data from an Outpatient Oncology Clinic in Lombardy (Italy). ABSTRACT: Lombardy was the first area in Italy to have an outbreak of coronavirus disease 19 (COVID-19) at the beginning of 2020. In this context, cancer has been reported as a major risk factor for adverse outcomes and death, so oncology societies have quickly released guidelines on cancer care during the pandemic. The aim of this study was to investigate the management of cancer patients and oncological treatments during the COVID-19 pandemic and to describe the containment measures performed in our outpatient clinic at Pavia (Lombardy). A comparison with the same period of the four previous years (2019, 2018, 2017, and 2016) was also performed. Using our electronic databases, we evaluated the number and characteristics of patients accessing the hospital for anticancer drug infusion from 24 February, 2020 to 30 April, 2020 and the number of radiological exams performed. Although a significant reduction in access for therapy was seen when compared with 2019 (2590 versus 2974, access rate ratio (ARR) = 0.85, p < 0.001), no significant differences in access numbers and ARR was evident between 2020 and 2018, 2017, or 2016 (2590 versus 2626 (ARR = 0.07), 2660 (ARR = 0.99), and 2694 (ARR = 0.96), respectively, p > 0.05). In 2020, 63 patients delayed treatment: 38% for \"pandemic fear\", 18% for travel restrictions, 13% for quarantine, 18% for flu syndrome other than COVID-19, and 13% for worsening of clinical conditions and death. Only 7/469 patients developed COVID-19. A significant reduction in radiological exams was found in 2020 versus all the other years considered (211 versus 360, 355, 385, 390 for the years 2020, 2019, 2018, 2017, and 2016, respectively, p < 0.001). The low incidence of COVID-19 among our cancer patients, along with the hospital policy to control infection, enabled safe cancer treatment and a continuum of care in most patients, while a small fraction of patients experienced a therapeutic delay due to patient-related reasons. TEXT: 1. Introduction Coronavirus disease 2019 (COVID-19) is a systemic infectious disease caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), which was first recognized in China at the end of December 2019, later becoming a pandemic [1].\\nReasoning: Let\\'s think step by step in order to', 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596521.3932981}