{"duration": 0.04793143272399902, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions. We need to find the medication mentioned in the article and then look for any potential side effects or adverse reactions listed.\\nReactions: hypoglycemia, weight gain\\n\\n---\\n\\nArticle: TITLE: Intravitreal aflibercept and ranibizumab for pachychoroid neovasculopathy. ABSTRACT: This retrospective study was to compare the efficacy of intravitreal injection of ranibizumab and aflibercept for patients with pachychoroid neovasculopathy. 54 eyes were initially treated with 3 monthly loading injections of ranibizumab or aflibercept. Treatment switching from ranibizumab to aflibercept, and aflibercept to photodynamic therapy was done at 3 months in case of incomplete fluid absorption. At 3 months, the rate of complete fluid absorption was significantly higher in the aflibercept-treated group than in the ranibizumab-treated group (82.6% vs 51.6%, p = 0.018). The mean reduction of subfoveal choroidal thickness was significantly greater in the aflibercept group than in the ranibizumab group (-35 µm vs -9 µm, p = 0.013). There was no significant difference between the two groups in terms of visual improvement or decrease in central macular thickness. Complete fluid absorption was achieved after switching from ranibizumab to aflibercept in 13 of 15 eyes (86.7%). Adjunctive photodynamic therapy was required in 6 eyes. In conclusion, treatment mainly with anti-vascular endothelial growth factor effectively improved visual acuity within 12 months (from 20/56 to 20/44 at 3 months and to 20/36 at 12 months). Aflibercept was superior to ranibizumab in achieving dry macula and reducing choroidal thickness at 3 months. TEXT: Introduction The term “pachychoroid neovasculopathy” has been introduced to describe Type 1 neovascularization associated with choroidal thickening and/or dilated Haller vessels in the absence of characteristic age-related macular degeneration features1,2. It is a newly recognized clinical entity of choroidal neovascularization (CNV) that is thought to be induced by pachychoroid phenotype–driven pathophysiological mechanisms3. This disease entity has been suggested to be in the spectrum between central serous chorioretinopathy (CSC) and polypoidal choroidal vasculopathy (PCV). Pang and Freund reported that pachychoroid neovasculopathy can develop after long-standing CSC and may eventually progress to PCV in some cases2.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596052.841231}