{"duration": 0.45030999183654785, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Hypokalemic paralysis, hypokalemia, hypomagnesemia, thiazide diuretics, alcohol abuse, anxiety, hypertension\\n\\n---\\n\\nArticle: TITLE: Fatal Disseminated Tuberculosis during Treatment with Ruxolitinib Plus Prednisolone in a Patient with Primary Myelofibrosis: A Case Report and Review of the Literature. ABSTRACT: A 73-year-old man with primary myelofibrosis (PMF) was being treated with hydroxyurea, which was changed to ruxolitinib treatment because of worsening constitutional symptoms. Although ruxolitinib rapidly induced relief, he developed a high-grade fever. A comprehensive fever work-up found no apparent cause of the fever, except for PMF. Therefore, we increased the dose of ruxolitinib and added prednisolone, which was gradually withdrawn with resolution of the fever. However, the patient subsequently developed disseminated tuberculosis and died eight months after initiation of ruxolitinib. Our case highlights the importance of assessing and monitoring the immune status of patients receiving ruxolitinib. TEXT: Introduction Primary myelofibrosis (PMF) is a clonal hematopoietic stem cell disorder resulting from mutations that include the JAK-STAT signaling regulator genes and/or epigenetic regulator genes (1). Allogeneic hematopoietic stem cell transplantation is the only treatment with curative potential for PMF, with other treatment options being palliative and focused on alleviating the constitutional symptoms. Ruxolitinib, a selective inhibitor of JAK1 and JAK2, significantly reduces splenomegaly and relieves constitutional symptoms, which results in an improved quality of life for patients with PMF (2). Although ruxolitinib is a promising and active treatment option, several recent case reports have suggested that patients treated with ruxolitinib might be at risk for various opportunistic infections, including reactivation of tuberculosis (3). However, because of a lack of evidence, there are no criteria for identifying those high-risk patients being treated with ruxolitinib who should be considered for prophylaxis/treatment. We herein report a patient with PMF who developed fatal disseminated tuberculosis during treatment with ruxolitinib plus prednisolone. Case Report A 73-year-old man was referred to our hospital because of marked splenomegaly (6 cm below the costal margin), thrombocytosis, and an elevated serum lactate dehydrogenase level in April 2013. A bone marrow biopsy showed grade 3 fibrosis with the JAK2 V617F mutation. He was diagnosed with PMF with an intermediate-2 risk score by the Dynamic International Prognostic Scoring System (DIPSS) Plus (4). Because ruxolitinib was not available in Japan at the time, he first received hydroxyurea (HU; 500 mg daily) to alleviate abdominal distension due to splenomegaly, which partially improved soon after the initiation of HU. However, his constitutional symptoms, including anemia, a low-grade fever, night sweats, and abdominal distention (splenomegaly 10 cm below the costal margin), worsened two years after starting HU.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596831.3998742}