{"duration": 0.024799346923828125, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Hypokalemic paralysis, hypokalemia, hypomagnesemia, thiazide diuretics, alcohol abuse, anxiety, hypertension\\n\\n---\\n\\nArticle: TITLE: Pneumonitis resulting from radiation and immune checkpoint blockade illustrates characteristic clinical, radiologic and circulating biomarker features. ABSTRACT: Pneumonitis is a potential consequence of both lung-directed radiation and immune checkpoint blockade (ICB), particularly treatment with PD-1/PD-L1 inhibitors. Significant morbidity and mortality can result, and severe pneumonitis attributed to ICB precludes continued therapy. Thus, discriminating between radiation- and ICB- related pneumonitis is of importance for the increasing number of patients receiving both treatments. Furthermore, data are limited regarding the interplay between radiation- and ICB-induced lung injury, and which biomarkers might be associated with toxicity. We report longitudinal clinical and radiologic data, and circulating biomarkers in a melanoma patient treated with axillary radiation followed by ICB who developed consolidation and ground glass opacities (GGO) within the radiation field suggestive of radiation-pneumonitis followed by consolidation outside of the radiation field suggestive of ICB-related pneumonitis. Of note, symptomatic radiation-pneumonitis developed despite a low radiation dose to the lung (V20 < 8%), and ICB-related pneumonitis was limited to the ipsilateral lung, suggesting additive effect of radiation and ICB in the development of lung injury. Circulating biomarker analyses demonstrated increases in CXCR2, IL1ra and IL2ra that coincided with the development of symptomatic pneumonitis. These data highlight the imaging findings associated with radiation and ICB-related lung toxicity, and anecdotally describe a clinical course with circulating biomarker correlates. This information can help guide clinical evaluation and future research investigations into the toxicity of combined radiation immunotherapy approaches. TEXT: Background Pneumonitis develops in less than 5% of patients treated with PD-1/PD-L1 inhibitor ICB monotherapy. [1, 2] Many cases are relatively mild, and patients can resume ICB therapy following steroid treatment and resolution of symptoms. However, < 1% of cases are more severe [1], and patients can require prolonged treatment, require hospitalization, and be precluded from additional ICB treatment, even if this therapy is otherwise providing clinical benefit. In addition to ICB, radiation therapy to the lung can also lead to an inflammatory pneumonitis generally treated with a lengthy course of corticosteroids in more severe cases. Rates of radiation pneumonitis vary significantly based on the amount of lung irradiated, as well as the dose of radiation that is delivered [3]. For example, in lung cancer patients, rates of grade 2 or higher pneumonitis were found to be 0% when the volume of the lung receiving 20 Gray (Gy) or higher was less than 22%, as compared to a 42% risk if the volume receiving 20 Gy or higher was greater than 40%. [4].\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596817.9267178}