{"duration": 0.22400808334350586, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Exposure-toxicity relationship of cabozantinib in patients with renal cell cancer and salivary gland cancer. ABSTRACT: Cabozantinib is registered in fixed 60 mg dose. However, 46% to 62% of patients in the registration studies needed a dose reduction due to toxicity. Improved clinical efficacy has been observed in renal cell carcinoma patients (RCC) with a cabozantinib exposure greater than 750 μg/L. In our study we explored the cabozantinib exposure in patients with different tumour types. We included RCC patients from routine care and salivary gland carcinoma (SGC) patients from a phase II study with ≥1 measured Cmin at steady-state. The geometric mean (GM) Cmin at the starting dose, at 40 mg and at best tolerated dose (BTD) were compared between both tumour types. Forty-seven patients were included. All SGC patients (n = 22) started with 60 mg, while 52% of RCC patients started with 40 mg. GM Cmin at the start dose was 1456 μg/L (95% CI: 1185-1789) vs 682 μg/L (95% CI: 572-812) (P < .001) for SGC and RCC patients, respectively. When dose-normalised to 40 mg, SGC patients had a significantly higher cabozantinib exposure compared to RCC patients (Cmin 971 μg/L [95% CI: 790-1193] vs 669 μg/L [95% CI: 568-788]) (P = .005). Dose reductions due to toxicity were needed in 91% and 60% of SGC and RCC patients, respectively. Median BTD was between 20 to 30 mg for SGC and 40 mg for RCC patients. GM Cmin at BTD were comparable between the SGC and the RCC group, 694 μg/L (95% CI: 584-824) vs 583 μg/L (95% CI: 496-671) (P = .1). The observed cabozantinib exposure at BTD of approximately 600 μg/L is below the previously proposed target. Surprisingly, a comparable exposure at BTD was reached at different dosages of cabozantinib for SGC patients compared to RCC patients Further research is warranted to identify the optimal exposure and starting dose to balance efficacy and toxicity. TEXT: pmcAbbreviations BTD best tolerated dose CI confidence interval C max maximum concentration C min trough concentration GM geometric mean HCC hepatocellular carcinoma ICI checkpoint inhibitors IMDC International Metastatic Database Consortium IRB Institutional Review Board MET hepatocyte growth factor receptor MTC medullary thyroid cancer OD once daily ORR overall response rate OS overall survival PFS progression free survival PK pharmacokinetics PPI proton pump inhibitor RCC renal cell carcinoma SGC salivary gland cancer TAM Tyro3, Axl and Mer TDM therapeutic drug monitoring TKI tyrosine kinase inhibitor VEGFR vascular endothelial growth factor receptor 1 INTRODUCTION\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597126.91229}