{"duration": 0.010550737380981445, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: The first case of thrombocytopenia, anasarca, fever, renal impairment or reticulin fibrosis, and organomegaly (TAFRO) syndrome with unilateral adrenal necrosis: a case report. ABSTRACT: BACKGROUND TAFRO syndrome, which was first reported in 2010 in Japan, is a relatively rare disease characterized by thrombocytopenia, anasarca, fever, renal impairment, reticulin fibrosis, and organomegaly. Although this disease is considered similar to multicentric Castleman disease, some of the clinical features, such as thrombocytopenia, are different from typical cases of multicentric Castleman disease. In addition, the etiology of TAFRO syndrome remains unknown and controversial. There have only been a few cases of TAFRO syndrome complicated with adrenal gland lesions, and all of them have had hemorrhagic involvement. METHODS This report describes the case of a 46-year-old Asian man who presented with fever, epigastric pain, and back pain for 1 month. A computed tomographic scan revealed ascites, mild lymphadenopathy, and left adrenal necrosis without hemorrhage. A blood test showed thrombocytopenia, anemia, and elevated C-reactive protein, alkaline phosphatase, and creatinine levels. Based on the edema, severe thrombocytopenia, fever, reticulin myelofibrosis shown by bone marrow biopsy, mild lymphadenopathy, and progressive renal insufficiency, we diagnosed this patient as having TAFRO syndrome. He was successfully treated by immediate administration of glucocorticoids and tocilizumab. CONCLUSIONS There have been no previous reports of a case of TAFRO syndrome complicated with adrenal necrosis. Because the biopsy of the left adrenal gland revealed necrosis without any evidence of hemorrhage, we concluded that the unilateral adrenal necrosis in this case was caused by either ischemia from infarction or organomegaly itself under severe hypercytokinemia. This unusual clinical course is useful for further analysis of the etiology of TAFRO syndrome. TEXT: Background TAFRO syndrome (thrombocytopenia, anasarca, fever, renal impairment or reticulin fibrosis, and organomegaly) was first reported by Takai et al. in 2010 [1], and several cases have since been reported, mainly in Japan, but also in other countries. At first, TAFRO syndrome was thought to be a subtype of human herpesvirus 8 (HHV-8)-negative idiopathic multicentric Castleman disease (iMCD), but Iwaki et al. recently reported that the pathophysiology of TAFRO syndrome seemed to differ from that of iMCD [2]. Along with increasing case reports, the diagnosis criteria and treatment guidelines, as well as the concept of this disease, have been established gradually [2, 3]. In terms of organ damage, the kidneys are commonly involved, and temporal hemodialysis is required in some cases [2]. Notably, there have only been a few cases of TAFRO syndrome complicated with adrenal lesions, and all of them have had hemorrhagic involvement [4, 5]. No cases accompanied by adrenal gland necrosis without hemorrhage have yet been reported.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596533.0174701}