{"duration": 0.7367637157440186, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Maternally inherited diabetes and deafness coexists with lipoprotein lipase gene mutation-associated severe hyperlipidemia that was resistant to fenofibrate and atorvastatin, but sensitive to bezafibrate: A case report. ABSTRACT: Maternally inherited diabetes and deafness is a rare genetic disease mainly caused by a point mutation in mitochondrial deoxyribonucleic acid. Lipoprotein lipase gene mutations are associated with familial dyslipidemias, which are difficult to manage. We reported for the first time a case that had both maternally inherited diabetes and severe hyperlipidemia caused by lipoprotein lipase gene mutation (C.347(exon3)G>C) that was resistant to fenofibrate and atorvastatin. We were able to manage the patient's hyperlipidemia with bezafibrate, and her diabetes was well controlled with insulin. In conclusion, genetic testing is helpful in identifying rare and interesting cases when clinicians suspect inheritable diseases. Additionally, when one fibrate drug is ineffective in treating hyperlipidemia, it might be worthwhile trying another fibrate. TEXT: pmcINTRODUCTION Maternally inherited diabetes and deafness is a rare genetic disease mainly caused by a point mutation in mitochondrial deoxyribonucleic acid (tRNA3243A>G). It is extremely rare when it coexists with another genetic disease. Lipoprotein lipase (LPL) is a rate‐limiting enzyme that hydrolyzes cleavage of the triglyceride core of lipoproteins, which is essential for TG clearance and modulation of lipid metabolism. LPL gene mutations result in disturbance in TG clearance and disorders in lipid metabolism. They are associated with several types of familial dyslipidemias 1 , 2 , 3 . Here, we report a case with severe hyperlipidemia who carries a point mutation in the LPL gene (heterozygous, C.347(exon3)G>C) (rs775728208) and a point mutation in mitochondrial deoxyribonucleic acid (tRNA3243A>G). CASE REPORT A 31‐year old female patient with low body mass index (14.5 kg/m2) was found to have elevated blood glucose 5 years earlier in a medical checkup. Her blood glucose was not well controlled until insulin was started 3 years earlier. Several of her family members from her mother’s descent had diabetes and hyperlipidemia (Figure 1). The patient’s grandmother died from diabetic ketoacidosis at the age of 33 years. Her aunt died from diabetic nephropathy at the age of 47 years. The patient’s mother, her aunt and cousin had mild hyperlipidemia that was being well managed with statins. The patient’s blood lipid profile on admission was 16.8 mmol/L (1486.73 mg/dL) for triglycerides (TG) and 9.91 mmol/L (382.53 mg/dL) for total cholesterol (TC). Abdominal ultrasonography showed splenomegaly. Her visual and auditory acuities were within the normal limits. The results of C‐peptide release test are shown in Table 1. Insulin autoantibody, protein tyrosine phosphatase antibody, islet cell antibody and glutamic acid decarboxylase antibody were negative.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597029.824204}