{"duration": 0.010330677032470703, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Isolated adrenocorticotropin deficiency induced by pembrolizumab for hypopharyngeal cancer: A case report. ABSTRACT: We report a case of isolated adrenocorticotropin deficiency caused by pembrolizumab. This condition can be fatal, but its rarity causes under-recognition. Oncologists should pay attention to adrenal insufficiency due to pembrolizumab. TEXT: A 78‐year‐old man with a history of surgery for hypopharyngeal cancer presented with a 3‐day‐long fever, anorexia, and vomiting. There were no other clinical symptoms. One week ago, he received the 11th cycle of pembrolizumab for lung metastasis. Since contrast‐enhanced computed tomography (CT) showed no clear findings and empiric antibiotic therapy was ineffective, he was referred to our department for investigation of fever of unknown origin. He had hyponatremia (135 mmoL/L) and increased antidiuretic hormone level (3.0 pg/mL) without eosinophilia (242/μL) or hypoglycemia (117 mg/dL). Basal plasma adrenocorticotropin (ACTH) was undetectable, and serum cortisol level was significantly lowered (0.6 μg/dL), and free cortisol in a twenty‐four‐hour urine collection was undetectable. Pituitary magnetic resonance imaging showed no specific findings (Figure 1A) and plain adrenal CT showed no abnormality (Figure 1B). A corticotropin‐releasing hormone test showed no response of ACTH or cortisol, while results for other anterior pituitary hormones in loading tests were unremarkable (Figure 1C). We diagnosed as isolated ACTH deficiency induced by pembrolizumab, which was improved by 10 mg per day of hydrocortisone treatment. FIGURE 1 A, Pituitary magnetic resonance imaging showed no remarkable pituitary enlargement, no thickened pituitary stalk, and no loss of signal intensity in the posterior lobe in T1‐weighted image (sagittal plane). B, Plain computed tomography showed that the bilateral adrenals had normal shapes. C, Anterior pituitary hormonal evaluation. A corticotropin‐releasing hormone (CRH) test (upper left) showed no response of ACTH or cortisol, while a gonadotropin‐releasing hormone (GnRH) test (upper right), thyrotropin‐releasing hormone (TRH) test (lower left), and growth hormone‐releasing peptide 2 (GHRP2) test (lower right) showed no remarkable results. ACTH, adrenocorticotropin; FSH, follicle‐stimulating hormone; GH, growth hormone; LH, luteinizing hormone; PRL, prolactin; TSH, thyroid‐stimulating hormone The programmed cell death 1 protein (PD‐1) inhibitor pembrolizumab has rarely been reported to cause isolated ACTH deficiency, in contrast to the same class agent nivolumab. 1 As in our case, PD‐1 inhibitors induce hypophysitis with less obvious clinical signs (such as headache and vision disorder) and radiological signs than does cytotoxic T‐lymphocyte antigen‐4. 2 Since this feature may lead to delayed or incorrect diagnosis, oncologists should recognize that pembrolizumab can induce ACTH deficiency. CONFLICT OF INTEREST None declared. AUTHOR CONTRIBUTIONS\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597181.2915497}