{"duration": 0.032334089279174805, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': 'Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let\\'s think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let\\'s think step by step in order to identify the adverse drug reactions affecting the patient. We will first look for any mention of medication in the article. Then, we will check for any symptoms or conditions that could be caused by the medication. Finally, we will confirm with the article if the medication was the cause of the symptoms.\\nReactions: hypokalemia, hypomagnesemia, pseudo-prolonged QT interval, ST depression, T-U wave fusion, QU interval, absent T wave\\n\\n---\\n\\nArticle: TITLE: Azacitidine for Front-Line Therapy of Patients with AML: Reproducible Efficacy Established by Direct Comparison of International Phase 3 Trial Data with Registry Data from the Austrian Azacitidine Registry of the AGMT Study Group. ABSTRACT: We recently published a clinically-meaningful improvement in median overall survival (OS) for patients with acute myeloid leukaemia (AML), >30% bone marrow (BM) blasts and white blood cell (WBC) count ≤15 G/L, treated with front-line azacitidine versus conventional care regimens within a phase 3 clinical trial (AZA-AML-001; NCT01074047; registered: February 2010). As results obtained in clinical trials are facing increased pressure to be confirmed by real-world data, we aimed to test whether data obtained in the AZA-AML-001 trial accurately represent observations made in routine clinical practice by analysing additional AML patients treated with azacitidine front-line within the Austrian Azacitidine Registry (AAR; NCT01595295; registered: May 2012) and directly comparing patient-level data of both cohorts. We assessed the efficacy of front-line azacitidine in a total of 407 patients with newly-diagnosed AML. Firstly, we compared data from AML patients with WBC ≤ 15 G/L and >30% BM blasts included within the AZA-AML-001 trial treated with azacitidine (\"AML-001\" cohort; n = 214) with AAR patients meeting the same inclusion criteria (\"AAR (001-like)\" cohort; n = 95). The current analysis thus represents a new sub-analysis of the AML-001 trial, which is directly compared with a new sub-analysis of the AAR. Baseline characteristics, azacitidine application, response rates and OS were comparable between all patient cohorts within the trial or registry setting. Median OS was 9.9 versus 10.8 months (p = 0.616) for \"AML-001\" versus \"AAR (001-like)\" cohorts, respectively. Secondly, we pooled data from both cohorts (n = 309) and assessed the outcome. Median OS of the pooled cohorts was 10.3 (95% confidence interval: 8.7, 12.6) months, and the one-year survival rate was 45.8%. Thirdly, we compared data from AAR patients meeting AZA-AML-001 trial inclusion criteria (n = 95) versus all AAR patients with World Health Organization (WHO)-defined AML (\"AAR (WHO-AML)\" cohort; n = 193). Within the registry population, median OS for AAR patients meeting trial inclusion criteria versus all WHO-AML patients was 10.8 versus 11.8 months (p = 0.599), respectively. We thus tested and confirmed the efficacy of azacitidine as a front-line agent in patients with AML, >30% BM blasts and WBC ≤ 15 G/L in a routine clinical practice setting. We further show that the efficacy of azacitidine does not appear to be limited to AML patients who meet stringent clinical trial inclusion criteria, but instead appears efficacious as front-line treatment in all patients with WHO-AML. TEXT: 1. Introduction\\nReasoning: Let\\'s think step by step in order to', 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596381.1894689}