{"duration": 0.03553581237792969, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Hypokalemic paralysis, hypokalemia, hypomagnesemia, thiazide diuretics, alcohol abuse, anxiety, hypertension\\n\\n---\\n\\nArticle: TITLE: The co-presence of deletion 7q, 20q and inversion 16 in therapy-related acute myeloid leukemia developed secondary to treatment of breast cancer with cyclophosphamide, doxorubicin, and radiotherapy: a case report. ABSTRACT: BACKGROUND Therapy-related acute myeloid leukemia occurs as a complication of treatment with chemotherapy, radiotherapy, immunosuppressive agents or exposure to environmental carcinogens. METHODS We report a case of therapy-related acute myeloid leukemia in a 37-year-old Turkish woman in complete remission from breast cancer. Our patient presented to our facility with fatigue, fever, sore throat, peripheral lymphadenopathy, and moderate hepatosplenomegaly. On peripheral blood and bone marrow aspirate smears, monoblasts were present. Immunophenotypic analysis of the bone marrow showed expression of CD11b, CD13, CD14, CD15, CD33, CD34, CD45 and human leukocyte antigen-DR, findings compatible with the diagnosis of acute monoblastic leukemia (French-American-British classification M5a). Therapy-related acute myeloid leukemia developed three years after adjuvant chemotherapy consisting of an alkylating agent, cyclophosphamide and DNA topoisomerase II inhibitor, doxorubicin and adjuvant radiotherapy. Cytogenetic analysis revealed a 46, XX, deletion 7 (q22q34), deletion 20 (q11.2q13.1) karyotype in five out of 20 metaphases and inversion 16 was detected by fluorescence in situhybridization. There was no response to chemotherapy (cytarabine and idarubicin, FLAG-IDA protocol, azacitidine) and our patient died in the 11th month after diagnosis. CONCLUSIONS The median survival in therapy-related acute myeloid leukemia is shorter compared to de novoacute myeloid leukemia. Also, the response to therapy is poor. In therapy-related acute myeloid leukemia, complex karyotypes have been associated with abnormalities of chromosome 5, rather than 7. To the best of our knowledge, this is the first case of therapy-related acute myeloid leukemia showing the co-presence of deletion 7q, 20q and the inversion 16 signal. TEXT: Introduction\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596810.3713255}