{"duration": 0.005635499954223633, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Quetiapine-induced sleep-related eating disorder: A case report. ABSTRACT: This is the first case report of two depressed Malay females prescribed quetiapine, the first patient developed sleep related eating disorder (SRED) on 200 mg per day and the second patient at 50 mg per day. Both resolved with discontinuation of the drug. Assessment for SRED should be done at every follow up. TEXT: 1 INTRODUCTION This is the first case report to document two Malay female patients with SRED. The patient in case 1 developed SRED at a dose of 200 mg but continued to have SRED until quetiapine was discontinued and then resumed the SRED when she was put on 5 mg of olanzapine. Both patients had no recollection of their actions as is characteristic of SRED, and both patients put on considerable weight during this time. SRED as a side effect of quetiapine needs to be highlighted as it has not been given much attention by medical personnel and is not even mentioned in the packaging insert. Antipsychotics should not be freely prescribed as sleep aids. Both patients' symptoms resolved after withdrawing the antipsychotics. Some antipsychotics have greater propensity to cause SRED than others. Patients need to be educated about side effects. Slow‐wave sleep (SWS) is deep sleep and occurs in the nonrapid eye movement (NREM) stages 3 and 4. 1 Frequent arousals during this stage lead to sleepwalking (SW). 2 SW and SRED are two separate entities but both are classified as parasomnias. 3 Serotonin receptors are involved in maintaining sleep and causing muscle hypotonia during sleep. 2 Atypical antipsychotics are commonly used in psychiatric and primary care practice and place patients at risk of parasomnias such as SRED, and this condition may go undetected especially among psychotic patients where it may be mistaken for psychosis. 2 SRED is defined as a condition which is characterized by multiple episodes of eating at the transition from night‐time sleep to arousal. 4 Quetiapine, olanzapine, chlorpromazine, and clozapine which act through serotonin receptors are often used off‐label to aid in sleep. 3 Medication‐induced SW and SRED have been reported with quetiapine being the most implicated. 5 The prevalence of SRED in the adult psychiatric population ranges from 1% to 5%. 6 Prevalence of SW is 6.9%. 7 Both conditions are little discussed during follow‐up visits and are generally not detected. 1 , 2 Quetiapine, 2 , 6 , 8 , 9 , 10 olanzapine, 2 and other atypical antipsychotic medications 2 have been associated with SW and have been reported to be associated with SRED. It is important to discuss this potential adverse effect with patients of these medications to prevent injuries and weight gain in the patient. 2 CASE 1\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597193.0801144}