{"duration": 0.021748065948486328, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Structural basis of acquired resistance to selpercatinib and pralsetinib mediated by non-gatekeeper RET mutations. ABSTRACT: Selpercatinib (LOXO-292) and pralsetinib (BLU-667) are highly potent RET-selective protein tyrosine kinase inhibitors (TKIs) for treating advanced RET-altered thyroid cancers and non-small-cell lung cancer (NSCLC). It is critical to analyze RET mutants resistant to these drugs and unravel the molecular basis to improve patient outcomes. Cell-free DNAs (cfDNAs) were analyzed in a RET-mutant medullary thyroid cancer (MTC) patient and a CCDC6-RET fusion NSCLC patient who had dramatic response to selpercatinib and later developed resistance. Selpercatinib-resistant RET mutants were identified and cross-profiled with pralsetinib in cell cultures. Crystal structures of RET-selpercatinib and RET-pralsetinib complexes were determined based on high-resolution diffraction data collected with synchrotron radiation. RETG810C/S mutations at the solvent front and RETY806C/N mutation at the hinge region were found in cfDNAs of an MTC patient with RETM918T/V804M/L, who initially responded to selpercatinib and developed resistance. RETG810C mutant was detected in cfDNAs of a CCDC6-RET-fusion NSCLC patient who developed acquired resistance to selpercatinib. Five RET kinase domain mutations at three non-gatekeeper residues were identified from 39 selpercatinib-resistant cell lines. All five selpercatinib-resistant RET mutants were cross-resistant to pralsetinib. X-ray crystal structures of the RET-selpercatinib and RET-pralsetinib complexes reveal that, unlike other TKIs, these two RET TKIs anchor one end in the front cleft and wrap around the gate wall to access the back cleft. RET mutations at the solvent front and the hinge are resistant to both drugs. Selpercatinib and pralsetinib use an unconventional mode to bind RET that avoids the interference from gatekeeper mutations but is vulnerable to non-gatekeeper mutations. TEXT: INTRODUCTION Genetic alterations of the rearranged during transfection (RET) gene occur in diverse cancers.1–4 Several multi-targeted tyrosine kinase inhibitors (TKIs) with RET inhibitor activity, such as vandetanib, cabozantinib, lenvatinib, and RXDX-105, have been tested in the clinic with modest efficacy.1,5,6 In addition to dose-limiting off-target effects, these TKIs are subject to resistance by gatekeeper mutations.1,7 Structurally, this is partly because these TKIs are known or predicted to occupy both the front and back drug-binding clefts of the RET kinase domain by going through the gate that separates these two clefts.8–12\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597087.9212446}