{"duration": 0.04473257064819336, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Survival and relative dose intensity of 5-fluorouracil, oxaliplatin and irinotecan in real-life treatment of metastatic colorectal cancer. ABSTRACT: Combinations of 5-fluorouracil/leucovorin (5-FU/LV) with oxaliplatin (FOLFOX) or irinotecan (FOLFIRI) are part of standard treatments for metastatic colorectal cancer (mCRC). For these molecules, the impact of a low relative dose intensity (RDI) on survival is not sufficiently known in real-life. Data were collected retrospectively from patients treated in our center for an unresectable mCRC with FOLFOX or FOLFIRI as a first-line treatment. To study the impact on progression-free survival (PFS) and overall survival (OS), patients were divided into high and low RDI according to the median RDI of 5-FU on one end, and the median RDI of oxaliplatin or irinotecan (OXA-IRI) on the other. In our population of 75 patients, the median age was 67.1 years and 77% of patients were treated with FOLFIRI. Patients with high RDI for OXA-IRI had better PFS compared to patients with low RDI (hazard ratio [HR], 0.58; p = 0.03). There was no statistically significant difference in PFS for patients with high RDI for 5-FU (HR, 0.66; p = 0.09). No difference was found in overall survival according to the RDI of OXA-IRI (HR, 0.72; p = 0.18) or 5-FU (HR, 0.77; p = 0.29). RDI had no significant impact on toxicities. Our analysis suggests that a low RDI of oxaliplatin and irinotecan has a negative effect on PFS. RDI had no significant effect on OS in our cohort. The clinical benefit of maintaining high RDI in these patients appears low. TEXT: Introduction In metastatic colorectal cancer (mCRC) with unresectable metastases, the combination of 5-fluorouracil/leucovorin (5-FU/LV) with oxaliplatin (FOLFOX regimen) or irinotecan (FOLFIRI regimen) is part of the first-line standard treatment that improved patient survival when compared to 5-FU/LV administered alone [1–4]. The use of monoclonal antibodies against VEGF and EGFR has also proved beneficial in this situation [5]. These treatments are intended to be administered at a certain dose and regimen. However, due to the onset of toxicities, it is common in clinical practice to make dose reductions or delay the administration of these molecules, which has the consequence of decreasing the relative dose intensity (RDI) [6, 7]. In many cancers, low chemotherapy RDI is associated with decreased disease control and survival [8–11]. With regard to mCRC, certain retrospective analyses of patients treated with FOLFOX or FOLFIRI have highlighted a link between survival and RDI of oxaliplatin and irinotecan [12, 13]. For 5-FU, one study has shown a possible link between RDI and response rate [14]; however, these results were not confirmed in a second trial when 5-FU was combined with LV [15]. In these studies, data resulted from clinical trials. As far as is known, in real-life, no study has shown a negative impact on survival of a low RDI of oxaliplatin, irinotecan or 5-FU in patients treated with FOLFOX or FOLFIRI [16, 17].\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596526.7422066}