{"duration": 0.014396190643310547, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': 'Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let\\'s think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let\\'s think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Cardiac Relapse of Acute Myeloid Leukemia after Allogeneic Hematopoietic Stem Cell Transplantation. ABSTRACT: Secondary or metastatic cardiac tumors are much more common than primary benign or malignant cardiac tumors. Any tumor can cause myocardial or pericardial metastasis, although isolated or combined tumor invasion of the pericardium is more common. Types of neoplasia with the highest rates of cardiac or pericardial involvement are melanoma, lung cancer, and breast and mediastinal carcinomas. Acute myeloid leukemia (AML) is the most common type of acute leukemia in adults. Initial treatment involves chemotherapy followed by consolidation treatment to reduce the risk of relapse. In high-risk patients, the treatment of choice for consolidation is hematopoietic stem cell transplantation (HSCT). Relapse of AML is the most common cause of HSCT failure. Extramedullary relapse is rare. The organs most frequently affected, called \"sanctuaries,\" are the testes, ovaries, and central nervous system. We present a case with extramedullary relapse in the form of a solid cardiac mass. TEXT: 1. Introduction Secondary or metastatic cardiac tumors are much more common than primary benign or malignant cardiac tumors. They usually appear after the age of 50 years in patients of either sex [1]. Metastasis to the heart can occur by direct invasion (mediastinal tumors), hematogenous spread, lymphatic spread, and intracavitary extension through the inferior vena cava [2]. Any tumor can cause myocardial or pericardial metastasis, although isolated or combined tumor invasion of the pericardium is more common. Types of neoplasia with the highest rates of heart or pericardial involvement are melanoma, lung cancer, breast carcinoma, and mediastinal carcinomas [3]. Clinical presentation depends primarily on the size of the tumor and its anatomical location rather than histological type. Thus, the symptoms can be grouped into three main categories: pericardial involvement can produce pericardial effusion or, less frequently, pericarditis, and myocardial involvement is associated with atrial or ventricular arrhythmias, with varying degrees of blockages and angina due to compression or tumor embolization, while right intracavitary tumors can cause right heart occupation [4]. Transthoracic echocardiography (TTE) is the primary diagnostic procedure, followed by computed tomography (CT) and cardiac magnetic resonance imaging (MRI) to verify positive findings and to analyze other structures of the mediastinum and chest [1]. The final diagnosis requires histologic confirmation. Treatment of such tumors is generally associated with poor results and unfavorable prognosis [1].\\nReasoning: Let\\'s think step by step in order to', 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596544.457948}