{"duration": 0.15711426734924316, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions. We need to find the medication mentioned in the article and then look for any potential side effects or adverse reactions listed.\\nReactions: hypoglycemia, weight gain\\n\\n---\\n\\nArticle: TITLE: Low-dose dexmedetomidine reduces emergence agitation after desflurane anaesthesia in children undergoing strabismus surgery. ABSTRACT: OBJECTIVE Emergence agitation (EA) is frequently observed in children undergoing general anaesthesia. This study tested whether the addition of an intra-operative low-dose infusion of dexmedetomidine to fentanyl treatment reduced the incidence of emergence delirium following desflurane anesthesia in children undergoing strabismus surgery. METHODS A total of 96 children (1-5 years old) undergoing strabismus surgery were enrolled. Anaesthesia was induced with propofol and maintained with desflurane. After induction, fentanyl (1 μg/kg) was administered to all children. During surgery, patients were infused with 0.2 μg/(kg·h)⁻¹ dexmedetomidine (Group FD, n=47) or normal saline (Group F, n=47). Postoperative objective pain score (OPS), Paediatric Agitation and Emergence Delirium (PAED) score, and EA score were documented every 10 minutes in the post-anaesthesia care unit. RESULTS There were no significant differences between the two groups in demographic characteristics and haemodynamic changes. The mean values of maximum EA, maximum PAED, and maximum OPS score were significantly lower in Group FD than in Group F at 0, 10, and 20 minutes after arrival at the post-anaesthesia care unit (p<0.001). The frequency of fentanyl rescue was lower in Group FD than in Group F (p<0.001). The incidence of severe EA was significantly lower in Group FD than in Group F (12.8% vs. 74.5%, p<0.001). CONCLUSIONS Intra-operative low-dose infusion of dexmedetomidine in addition to fentanyl reduces EA following desflurane anaesthesia in children undergoing strabismus surgeries. TEXT: INTRODUCTION Emergence delirium (ED) and emergence agitation (EA) are common phenomenon in paediatric patients undergoing general anaesthesia by inhalation agents. The incidence of ED or EA was reported to range from 18% to 80%.1,2 Agitated behaviour associated with ED can delay discharge from the post-anaesthesia care unit (PACU), decrease parent and caregiver satisfaction, and increase the overall cost to the institution.3 Risk factors for development of ED include preschool age, previous surgery, adaptability, ophthalmology or otorhinolaryngology procedure, and inhalation agents associated with fast emergence.1,4 Strabismus surgery is one of the most common ophthalmologic operations in children under 5 years old and can be associated with moderate postoperative pain caused by the conjunctiva5 and a high incidence of EA (40-86%).6-9 As this procedure commonly elicits the oculo-cardiac reflex (OCR) by traction on extraocular muscles and their adnexa or by application of sudden pressure to the eye or orbit, arrhythmias such as bradycardia are frequently encountered during the procedure. Therefore, anaesthetic strategies for strabismus surgery in paediatric patients include prevention of haemodynamic instability as well as reduction of postoperative pain and EA.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596057.8725865}