{"duration": 0.012328386306762695, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Catatonia-Induced Saddle Pulmonary Embolism. ABSTRACT: In this case report, we highlight a patient with catatonia secondary to schizoaffective disorder, depressive type. This patient developed a bilateral deep venous thrombosis progressing to a saddle pulmonary embolism without any predisposing factors to hypercoagulability other than immobility and obesity. The goal of this case report is to increase monitoring and prophylactic treatment for deep venous thrombosis in patients with catatonia, retarded type. TEXT: Introduction Pulmonary embolism (PE) is a potentially life-threatening complication of deep venous thromboses (DVTs). Thrombosis of blood can be caused by a state of hypercoagulability, vessel wall injury, and stasis of blood commonly referred to as Virchow’s triad. There are many factors that can lead to hypercoagulability including genetic factors, acquired factors, environmental factors, mixed factors, and others not well established. One of the most important acquired factors that require focus for patients with mental illness is immobility [1]. Pulmonary emboli are commonly caused by dislodged DVTs provoked by the contractile movement of the lower extremity muscles causing veins to pump blood and emboli back to the heart and pulmonary vasculature. Pulmonary emboli have a high rate of mortality, especially in patients with illnesses causing retarded-type catatonia [2]. Catatonia is a behavioral syndrome with the incapacity to move properly, which occurs in various psychiatric and non-psychiatric illnesses. In fact, 10% of acutely ill psychiatric patients in an inpatient psychiatric unit were found to have catatonia, most of who presented with mood disorders [3]. It is described in the Diagnostic and Statistical Manual of Mental Disorders 5 (DSM-5) as having “three or more of 12 psychomotor features in the diagnostic criteria for catatonia associated with another mental disorder and catatonic disorder due to another medical condition.” These symptoms include stupor, catalepsy, waxy flexibility, mutism, negativism, posturing, mannerism, stereotypy, agitation not influenced by external stimuli, grimacing, echolalia, and echopraxia. The severity of catatonia can be measured through the 23-item Bush-Francis Catatonia Rating Scale, which measures the previously mentioned signs and symptoms of catatonia. Each item is scored 0-3 depending on severity. The higher the score, the more unstable the patient will be [4]. There are three subtypes: retarded, excited, and malignant. The retarded type is described as having an inability to move, staring, posturing, negativism, and mutism [5]. For centuries, schizophrenia has been divided into two different groups: catatonia group and non-catatonia group [6]. Catatonia is now described in the DSM-5 as a separate condition most commonly associated with mood disorders such as bipolar I and II; however, it is also associated with schizophrenia spectrum disorders and autism spectrum disorder [3]. There are many complications to catatonia including malnut\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597026.559225}