{"duration": 0.02346634864807129, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Hollow Visceral Myopathy, a Rare Gastrointestinal Disorder: A Case Report and Short Review. ABSTRACT: Hollow visceral myopathy (HVM) is described as impaired intestinal function and motility in the absence of mechanical obstruction. In this case report, we describe a unique case of an 18-year-old female who presented to the hospital with complaints of persistent nausea, vomiting, inability to tolerate oral feeds, and substantial weight loss for 2 months. After appropriate investigations, a diagnosis of gastroparesis was established. The patient was started on metoclopramide, which led to significant symptomatic improvement, and she was eventually discharged home. One month after discharge, she presented to the hospital with symptoms similar to her initial presentation. After further laboratory and radiological investigation, she was diagnosed with severe gastroparesis and chronic intestinal pseudo-obstruction. Over the next month, the patient was given an extensive trial of multiple prokinetic agents such as mirtazapine, ondansetron, pyridostigmine, octreotide, and promethazine, but she failed to show clinical improvement. Due to failure of medical therapy, a nasojejunal feeding tube was placed for enteral nutrition. However, the patient reported worsening of her symptoms despite slow feeding rates; hence, a decision was made to start the patient on total parenteral nutrition and transfer her to a larger tertiary center for higher level of care. At the tertiary hospital, the patient was continued on total parenteral nutrition and underwent extensive evaluation. Ultimately, she was diagnosed with HVM after a laparoscopic full-thickness intestinal biopsy showed histopathological evidence of the disease. She underwent isolated small intestine transplant, which led to significant improvement of her symptoms and was eventually discharged home. The patient continues to be symptom-free and follows up with Gastroenterology and Transplant Surgery regularly. This case report highlights a rare clinical condition, HVM, as a potential diagnosis in patients with clinical features of intestinal obstruction without mechanical obstruction. TEXT: Introduction\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597078.6827962}