{"duration": 0.03252434730529785, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Pathologic Femoral Neck Fracture Due to Fanconi Syndrome Induced by Adefovir Dipivoxil Therapy for Hepatitis B. ABSTRACT: In Fanconi syndrome, hypophosphatemic osteomalacia is caused by proximal renal tubule dysfunction which leads to impaired reabsorption of amino acids, glucose, urate, and phosphate. We present a rare case of a 43-year-old Korean male who was found to have insufficiency stress fracture of the femoral neck secondary to osteomalacia due to Fanconi syndrome. He had been receiving low-dose adefovir dipivoxil (ADV, 10 mg/day) for the treatment of chronic hepatitis B virus infection for 7 years and he subsequently developed severe hypophosphatemia and proximal renal tubule dysfunction. The incomplete femoral neck fracture was fixed with multiple cannulated screws to prevent further displacement of the initial fracture. After cessation of ADV and correction of hypophosphatemia with oral phosphorus supplementation, the patient's clinical symptoms, such as bone pain, muscle weakness, and laboratory findings improved. TEXT: Fanconi syndrome (also known as Fanconi's syndrome) is a disease of the proximal renal tubules of the kidney in which glucose, amino acids, uric acid, phosphate, and bicarbonate are passed into the urine, instead of being reabsorbed.1) Osteomalacia is the softening of the bones caused by defective bone mineralization secondary to inadequate levels of available phosphate and calcium. Adefovir dipivoxil (ADV) is a commonly used antiviral agent in the treatment of chronic hepatitis B virus (HBV) or human immunodeficiency virus (HIV) infection. According to the literature, high-dose ADV therapy (60–120 mg/day) is nephrotoxic, whereas low-dose ADV therapy (daily dose of 10 mg) has been reported to be safe.23) Although use of low-dose ADV therapy for chronic hepatitis B has been advocated in large clinical trials, several cases of hypophosphatemic osteomalacia due to Fanconi syndrome in patients receiving prolonged ADV treatment have been reported recently.4) However, a report of pathologic fracture induced by low dose ADV therapy is rare. Here, we report a case of pathologic fracture of the femoral neck that developed in a chronic hepatitis B patient who was receiving prolonged ADV therapy at a dose of 10 mg daily. CASE REPORT\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596521.501937}