{"duration": 0.031792402267456055, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Gastric perforation related to concurrent use of nintedanib and ramucirumab. ABSTRACT: The prevalence of lung cancer in idiopathic pulmonary fibrosis (IPF) patients ranges from 9.8 to 38%. Nintedanib, a small molecule receptor tyrosine kinase inhibitor (TKI) of platelet-derived growth factor receptor (PDGFR), fibroblast growth factor receptor (FGFR), and vascular endothelial growth factor receptor (VEGFR), has been approved for IPF after phase III INPULSIS trials in 2014. Ramucirumab, a monoclonal antibody for VEGFR-2, combined with docetaxcel, has been approved for advanced non-small cell lung cancer (NSCLC) after the phase III REVEL trail in 2014. Physicians will have more IPF patients being treated with nintedanib, who subsequently develop NSCLC, and therefore will likely be treated with ramucirumab plus docetaxel. We report the first case of 70-year-old man taking nintedanib for his IPF and treated with ramucirumab plus docetaxel as a seventh-line therapy for his pulmonary adenocarcinoma. On day 15 of his chemotherapy treatment cycle 2, after taking nintedanib for nine days, he developed gastric perforation. TEXT: Introduction Nintedanib, a small molecule receptor tyrosine kinase inhibitor (TKI) of platelet‐derived growth factor receptor (PDGFR), fibroblast growth factor receptor (FGFR), and vascular endothelial growth factor receptor (VEGFR), was approved as a treatment for idiopathic pulmonary fibrosis (IPF) in 2014. Ramucirumab, a monoclonal antibody against VEGFR‐2, combined with docetaxcel, has also been recently approved as a second‐line chemotherapy for advanced non‐small cell lung cancer (NSCLC). The prevalence of lung cancer in IPF patients is reported to range from 9.8 to 38% 1. The number of patients taking nintedanib for their IPF who develop lung cancer, with the probability of being treated with ramucirumab plus docetaxel, will likely increase. We report the first case of gastric perforation related to the concurrent use of nintedanib for IPF and ramucirumab for NSCLC. Case Report\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596526.9639144}