{"duration": 0.034517765045166016, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Liver Injury Associated With Ezetimibe Monotherapy. ABSTRACT: Statin intolerance, primarily myalgia, is not uncommon in patients treated for elevated low-density lipoprotein cholesterol. Nonstatin drugs, such as ezetimibe, can spare patients from statin exposure, while still reducing low-density lipoprotein cholesterol. Ezetimibe is generally very well tolerated, although gastrointestinal and musculoskeletal symptoms have been occasionally reported. We describe an extremely rare case of an ezetimibe-associated liver injury who required protracted treatment with prednisone and azathioprine. Ezetimibe-associated liver injury should be suspected with development of hepatic abnormalities concurrent with the timing of ezetimibe treatment and in the absence of other possible precipitating factors. TEXT: Statins are the cornerstone therapy to reduce low-density lipoprotein (LDL) cholesterol levels and its associated risk of atherosclerotic cardiovascular disease.1 However, statin intolerance, primarily statin-associated muscle symptoms affect 2.5%-5% of patients.2 Nonstatin drugs are thus essential to spare affected patients from statin exposure, while still reducing LDL cholesterol.1 Treatment guidelines endorse the use of both ezetimibe and inhibitors of proprotein convertase subtilisin/kexin type 9 (PCSK9) as safe and effective second-line LDL-lowering treatments to consider in response to statin intolerance.1 Ezetimibe lowers LDL cholesterol by blocking sterol uptake via the Niemann-Pick C1-like 1 protein (NPC1L1) in the upper small intestine.3 It has been available in Canada since 2003. Ezetimibe is generally very well tolerated, although gastrointestinal and musculoskeletal symptoms have been reported in approximately 0.1%-2% of patients.4, 5, 6, 7 Although no cases of ezetimibe-induced liver injury were observed in randomized clinical trials, there are a few case reports of this complication.4, 5, 6, 7 We describe an extremely rare case of an ezetimibe-associated liver injury. Case Report A 59-year-old asymptomatic man of European descent was referred to the lipid clinic with high LDL cholesterol levels. His medical history was positive only for appendectomy and he was not taking any medication including neither natural health products nor supplements. He had no history of the use of either alcohol or recreational drugs. His family history was positive for dyslipidemia in 2 brothers, one of whom died of a myocardial infarction at age 67. The patient’s father and mother each also died from sudden cardiac events at ages 62 and 80, respectively. On physical examination, his height was 180 cm, weight was 81.5 kg, body mass index (BMI) was 25.2 kg/m2, supine blood pressure was 104/60 mm Hg, and radial pulse was 75 beats/min. No physical stigmata of familial hypercholesterolemia were detected, that is, no xanthomas, xanthelasmas, or corneal arcus. There was no hepatosplenomegaly, and cardiovascular examination was normal.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597171.8823273}