{"duration": 0.02909111976623535, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions. We need to find the medication mentioned in the article and then look for any potential side effects or adverse reactions listed.\\nReactions: hypoglycemia, weight gain\\n\\n---\\n\\nArticle: TITLE: Deep vein thrombosis in a patient of adenomatous polyposis coli treated successfully with aspirin: A case report. ABSTRACT: BACKGROUND Deep vein thrombosis is an important cause of morbidity and mortality. However, its association with adenomatous polyposis coli is extremely rare. Here we present an interesting case of deep vein thrombosis associated with adenomatous polyposis coli. METHODS A 15 year old female who was having fever and diarrhea for 5 months developed bilateral asymmetric painful swelling of lower limbs for 1 month. Doppler ultrasound of lower limbs revealed presence of thrombosis from inferior vena cava up to popliteal vein. Colonoscopy and biopsy were suggestive of adenomatous polyposis coli. However, she could not tolerate anticoagulant therapy and was put on aspirin therapy for 6 months to which she responded well with the resolution of thrombus. CONCLUSIONS Role of aspirin therapy may be considered whenever a patient of venous thrombosis cannot tolerate anticoagulant therapy. TEXT: Venous thromboembolism is an important cause of hospital acquired morbidity and mortality (1). Its association with adenomatous polyposis coli is a rare event (2, 3). Malignancy or major operative procedure associated with colonic polyp may predispose to thromboembolic event (2). There has been previously published few reports of diarrhea associated with deep vein thrombosis (4-6). Etiology of diarrhea in those cases was unrelated to colonic polyp. However, association of deep vein thrombosis with non-malignant colonic polyp presenting with diarrhea is an extremely rare event with a report of only one case in previous English literature (3). Mainstay of therapy of deep vein thrombosis is anticoagulation. However, fatal bleeding episode following anticoagulation in our patient lead to withdrawal of anticoagulation therapy. The patient was treated successfully with low dose aspirin therapy (75mg/day) with complete resolution of thrombus. Case Presentation A 15-year-old unmarried female presented to us with complain of asymmetric onset lower limb swelling for last 1 month. The swelling initially involved the left lower limb and for last 1 week she had also developed right lower limb swelling. The swelling which was initially painless later became painful. She was also having low grade irregular fever for last 5 months along with small amount of non-foul smelling mucus containing recurrent episodes of diarrhea for the same duration along with a history of significant weight loss. She had an episode of hematochezia 1 day after admission. There was no history of abdominal pain, vomiting, abdominal distension, facial puffiness, oliguria, bleeding from any other sites, joint pain, skin rash, recent contact with tuberculosis, recent surgery or prolonged immobilization. She had mild pallor and her body mass index (BMI) was 17.5 kg/mt2. She had bilateral pitting pedal edema along with raised local temperature and a positive Homans’ sign and Moses’ sign.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596059.060922}