{"duration": 0.028748273849487305, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions. We need to find the medication mentioned in the article and then look for any potential side effects or adverse reactions listed.\\nReactions: hypoglycemia, weight gain\\n\\n---\\n\\nArticle: TITLE: Cannabis-Related Diffuse Alveolar Hemorrhage in a 16-Year-Old Patient: A Case Report. ABSTRACT: Diffuse alveolar hemorrhage (DAH) is a clinical condition characterized by the rapid onset of dyspnea, hemoptysis and acute respiratory failure (ARF). It is commonly caused by autoimmune systemic vasculitis, pulmonary infections, drugs and tumors. Here, we report a case of DAH caused by frequent cannabis smoking. A 16-year old boy presented with hemoptysis, dyspnea and ARF soon after laparoscopic surgery for varicocele in general anesthesia. The suspected diagnosis of DAH emerged from the initial chest radiography, and it was then confirmed by CT scan findings and the bronchoalveolar lavage. His general conditions completely recovered after only 24 h of oxygen supplementation and after intravenous corticosteroid and antibiotic therapy. This is the first pediatric case of DAH related to smoking marijuana, even though the inhalational anesthetic agent sevoflurane might have also been involved in this pathogenesis. Other possible causes of DAH have been considered. Negative-pressure pulmonary edema could be ruled out because no clinical evidence of upper airway obstruction was observed during general anesthesia and throughout the surgery. In addition, a possible causative role of cannabis additives/contaminants could not be excluded. Given the high prevalence of cannabis smoking in young people and that DAH can be a complication in cannabis smokers, a careful history and high index of suspicion are recommended as part of the pre-operative assessment before these patients are proceeded to receive general anesthesia. TEXT: Background Diffuse alveolar hemorrhage (DAH) is a medical condition characterized by bleeding into the alveolar spaces of the lungs due to the disruption of the alveolar-capillary basement membrane. It manifests as rapid onset of dyspnea, hemoptysis and acute respiratory failure (ARF) (1). The etiology can vary from autoimmune systemic vasculitis to pulmonary infections, drugs, and tumors, which can lead to pulmonary capillaritis, bland pulmonary hemorrhage, or diffuse alveolar damage (2–4). In particular, a strong association between DAH and the use of recreational drugs, such as cocaine, amphetamine and crack, has been well-documented (5, 6). Regarding pot smoking and DAH, literature is very poor since only few cases in adult patients have been described so far (7–11). Nonetheless, the prevalence of this recreational drug is increasing worldwide, including Italy where the lifetime prevalence of cannabis use is 27% among adolescents aged 16 years old (12, 13). In this regard, Italy has experienced a boom in light cannabis smoking since Law No. 242 went into effect December 2016, legalizing hemp cultivation and commercialization but paradoxically not its consumption (14).\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596054.4506018}