{"duration": 0.5474147796630859, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Low-dose subcutaneous immunoglobulin is an effective treatment for autoimmune bullous skin disorders: A case report. ABSTRACT: Intravenous immunoglobulin is a recognized treatment in recalcitrant autoimmune bullous diseases. Infusions are administered monthly over 1-5 days in the hospital setting and associated with mild to severe infusion-related systemic effects, in part due to the high doses necessary to induce and achieve remission. We present a case series of four patients with bullous diseases treated successfully with low-dose subcutaneous IgG who achieved remission with maintenance therapy. Patient-administered smaller, more frequent doses of IgG into subcutaneous tissue more closely mimics the body's own antibody production and produces a more stable serum trough level. Subcutaneous IgG is a novel treatment approach in bullous diseases which can induce a state remission. TEXT: Introduction Autoimmune bullous diseases are characterized by bullous lesions to the skin and mucous membranes of the oral cavity, nose, eyes, larynx, pharynx, esophagus, and genitals.1 Once considered fatal conditions, treatment options have evolved from corticosteroids to steroid-sparing immunosuppressant drugs (methotrexate (MTX), azathioprine and mycophenolic acid (MMF)), monoclonal antibodies (rituximab), and intravenous immunoglobulin (IVIG).2–4 IVIG is a human plasma derivative containing IgG and has been used in conjunction with conventional therapy to treat refractory bullous diseases.2,4 Subcutaneous IgG (SCIG) is an effective alternative for patients refractory to or unable to tolerate immunosuppressive therapy.4 Moreover, it has been shown to be more cost-effective than immunosuppressives, which can result in significant toxicities requiring hospitalization.5 The immunomodulatory effects are complex and multifaceted, including increased catabolism of autoantibodies, inhibition in autoantibody function, and decrease in plasma inflammatory markers.2,3,6 Optimal dosing varies but follows similar conventional weight-based approaches (300–400 mg/kg/month) as well as higher doses (2 g/kg over 2–5 days/month) in aggressive disease.2,4,7 Adverse events can be mild (headaches, backaches, hives), severe (anaphylaxis, thromboembolism), and are usually infusion-related and self-limiting. However, adverse events increase with higher doses and may interfere with patient’s quality of life.3,6 The goal of therapy in the bullous diseases is to induce and maintain remission, as evidenced by the cessation of new vesicle and bullae formation and healing of old lesions.3,8 Long-term therapy may be required in recalcitrant disease and may be associated with significant toxicities if corticosteroids or immunosuppressants are needed, particularly in elderly patients with bullous pemphigoid.8 In the present case series, we describe the use of low-dose SCIG (Hizentra; CSL Behring Inc) to safely induce and maintain long-term remissions in four patients\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596537.997466}