{"duration": 0.14069199562072754, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Hypokalemic paralysis, hypokalemia, hypomagnesemia, thiazide diuretics, alcohol abuse, anxiety, hypertension\\n\\n---\\n\\nArticle: TITLE: DPYD and Fluorouracil-Based Chemotherapy: Mini Review and Case Report. ABSTRACT: 5-Fluorouracil remains a foundational component of chemotherapy for solid tumour malignancies. While considered a generally safe and effective chemotherapeutic, 5-fluorouracil has demonstrated severe adverse event rates of up to 30%. Understanding the pharmacokinetics of 5-fluorouracil can improve the precision medicine approaches to this therapy. A single enzyme, dihydropyrimidine dehydrogenase (DPD), mediates 80% of 5-fluorouracil elimination, through hepatic metabolism. Importantly, it has been known for over 30-years that adverse events during 5-fluorouracil therapy are linked to high systemic exposure, and to those patients who exhibit DPD deficiency. To date, pre-treatment screening for DPD deficiency in patients with planned 5-fluorouracil-based therapy is not a standard of care. Here we provide a focused review of 5-fluorouracil metabolism, and the efforts to improve predictive dosing through screening for DPD deficiency. We also outline the history of key discoveries relating to DPD deficiency and include relevant information on the potential benefit of therapeutic drug monitoring of 5-fluorouracil. Finally, we present a brief case report that highlights a limitation of pharmacogenetics, where we carried out therapeutic drug monitoring of 5-fluorouracil in an orthotopic liver transplant recipient. This case supports the development of robust multimodality precision medicine services, capable of accommodating complex clinical dilemmas. TEXT: 1. Introduction to Fluoropyrimidines 5-fluorouracil (5-FU) has remained an important antineoplastic agent since the first description of the fluoropyrimidine class in 1957, and approval for testing in humans in 1962 [1,2]. Fluoropyrimidines, including 5-fluorouracil and its oral pre-prodrug capecitabine, serve as core components in the treatment of colorectal, pancreatic, gastric, breast, head and neck cancers [2,3,4]. However, the use of fluoropyrimidines carries an unfortunate risk of severe adverse events (AEs) of up to 30% [5,6]. Common AEs observed with fluoropyrimidine chemotherapies include non-bloody diarrhea, mucosal ulceration, immune suppression, and a painful skin condition known as hand-foot syndrome. Through optimizing the delivery methods, dosing schedules, and concomitant antineoplastic agents, a number of modern combination regimens with a fluoropyrimidine backbone have emerged including FOLFOX, FOLFIRINOX, CAPOX, and FLOT. Nevertheless, clinical trials using fluoropyrimidine-based chemotherapies continue to show severe AE rates up to 23% [7,8,9,10]. Accordingly, delineating the genetic and non-genetic determinants of fluoropyrimidine metabolism and efficacy, is essential to the implementation of precision medicine approaches for fluoropyrimidine-based chemotherapy.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596820.770928}