{"duration": 0.392897367477417, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Multiple Fixed Drug Eruption Mimicking Parapsoriasis en Plaque in a Patient with Hepatitis C Virus Infection. ABSTRACT: Although hepatitis C virus (HCV) infection is often associated with extrahepatic cutaneous manifestations such as lichen planus, it is unclear whether HCV per se or HCV-specific immune responses play a pathophysiological role in the development of HCV-related cutaneous diseases. We recently treated a patient who developed parapsoriasis en plaque-like lesions after ingestion of various drugs. She showed hypersensitivity to multiple drugs after interferon therapy. Her clinical course was complicated by flares of parapsoriasis-like lesions which returned at precisely the same sites. The flares had begun within hours of ingesting nicardipine hydrochloride, amlodipine besilate, candesartan cilexetil and atenolol for the first time despite showing a low level of HCV RNA. Interestingly, the flares gradually subsided during continued treatment with these drugs while her HCV RNA level paradoxically increased: thus, there was an inverse correlation between flares and HCV RNA level. The eruptions were eventually diagnosed as fixed drug eruption, although the clinical manifestations mimicked parapsoriasis en plaque. Our results suggest that multiple drug hypersensitivity could be induced by antiviral immune responses that are cross-reactive to multiple drugs, but not by HCV per se. TEXT: Introduction Although it has been reported that hepatitis C virus (HCV) can be pathogenic for several skin diseases [1, 2, 3], it is unclear whether HCV per se or hepatitis treatment agents cause these diseases. Although recently developed interferon (IFN)-free therapies for HCV shorten the treatment duration and alleviate sustained virologic responses [4], pegylated IFN (PEG-IFN) concomitant with ribavirin is used in patients with HCV genotype 1b [5, 6], and, as IFN is known to affect the cytokine cascade [7, 8], adverse effects of treatment with IFN plus ribavirin are attributed to IFN. Accordingly, since IFN can stimulate macrophages to produce IL-15, which activate anti-viral CD8 and natural killer cell responses [9], we hypothesized that adverse events in patients treated with these agents were IFN-induced immune responses not effects of HCV per se. If adverse events in HCV-infected patients were sustained HCV-specific immune responses, development or exacerbation of such events should be temporarily associated with decreased HCV viral load. We report serial measures of HCV viral load and incidence of comorbid dermal lesions in a patient with chronic HCV infection. Case Report\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596544.2480116}