{"duration": 0.03957080841064453, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Optimal Glycemic Control in a Patient With HNF1A MODY With GLP-1 RA Monotherapy: Implications for Future Therapy. ABSTRACT: We present the case of a 27-year-old woman with inadequately controlled HNF1A maturity-onset diabetes of the young (MODY) who was successfully transitioned from sulfonylurea therapy to once-weekly monotherapy with dulaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA). More than a decade from diabetes diagnosis, she has maintained optimal glycemic control without hypoglycemia for >12 months while receiving GLP-1 RA therapy alone. This case illustrates the potential for successful use of GLP-1 RA monotherapy in patients with HNF1A MODY. TEXT: Maturity-onset diabetes of the young (MODY) accounts for at least 1% to 2% of diabetes cases. The various MODY phenotypes form part of a heterogenous group of monogenic diabetes phenotypes transmitted in an autosomal dominant fashion. Individuals are often misdiagnosed as having type 1 or type 2 diabetes, depending on the age at diagnosis and clinical presentation. Along with mutations in the glucokinase gene, mutations in the hepatocyte nuclear factor 1⍺ (HNF1A) gene account for most cases [1]. Individuals with HNF1A MODY typically demonstrate marked sensitivity to sulfonylureas, which are recommended as first-line therapy [2]. However, hypoglycemia related to sulfonylurea use may become problematic in certain individuals. When added to the potential for weight gain with this class of medications, this raises the question of whether nonsulfonylurea therapies may have a role to play. Given the glucose-dependent mechanism of action and widespread efficacy of GLP-1 RA in type 2 diabetes, in addition to low hypoglycemia risk with use as monotherapy, beneficial effects on body weight, and evidence supporting cardiovascular benefit in type 2 diabetes, this class of medications holds potential that is yet to be fully explored in certain MODY phenotypes. To date, there are limited data on the use of GLP-1 RA in patients with confirmed HNF1A MODY. One a short-term, 6-week clinical trial examined liraglutide as monotherapy, and several case reports have documented GLP-1 RA as adjunctive therapy [3, 4]. To our knowledge, no prior reports have addressed the use of weekly dulaglutide therapy in patients with confirmed HNF1A MODY or the long-term use of incretin monotherapy in this population. 1. Clinical Case\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: GLP-1 RA, sulfonylurea, hypoglycemia, weight gain, liraglutide, dulaglutide\\n\\n---\\n\\nArticle: TITLE: Immunotherapy choice and maintenance for generalized myasthenia gravis in China. ABSTRACT: To compare long-term efficacy and safety of immunotherapeutic strategies as maintenance to prevent disease relapses of generalized myasthenia gravis (MG) in real-world settings. This is a retrospective cohort study on generalized MG conducted in seven major neurological centers across China. Eligible participants were patients with generalized MG who were under minimal manifestation status or better. Main outcome measures were probability of patients free of relapses and causes of drug discontinuation. Among 1064 patients enrolled, the median (interquartile range) age was 50.3 (37.0-62.5) years and 641 (60.2%) were women. Disease relapse was significantly lower for rituximab (6.1%) compared with all the other monotherapies (hazard ratio [HR] = 0.18, 95% confidence interval [CI] 0.06 to 0.56, P = .0030). As combination therapies, tacrolimus in combination with corticosteroids reduced risk of disease relapses compared with azathioprine with corticosteroids (HR = 0.45, 95% CI 0.25 to 0.81, P = .0077) or mycophenolate mofetil with corticosteroids (HR = 0.32, 95% CI 0.15 to 0.67, P = .0020). Otherwise, lower-dose corticosteroids or azathioprine as monotherapy significantly increased risk of disease relapses (HR = 2.78, 95% CI 1.94 to 3.99, P < .0001; HR = 2.14, 95% CI 1.42 to 3.23, P = .0003, respectively). The proportion of discontinuation was lowest in patients with rituximab (20.4%) as monotherapy and tacrolimus with corticosteroids (23.6%). Overall, combination treatment of immunosuppressants with corticosteroids had a lower rate of discontinuation compared with corresponding monotherapy (HR = 0.51, 95% CI 0.36 to 0.71, P < .0001). Rituximab as monotherapy and tacrolimus with corticosteroids displayed better clinical efficacy as well as drug maintenance to prevent disease relapses in patients with generalized MG. TEXT: 1 INTRODUCTION Myasthenia gravis (MG) is an autoantibody‐mediated autoimmune disorder against postsynaptic membrane proteins at the neuromuscular junction, including acetylcholine receptor (AChR), muscle‐specific kinase (MuSK), and lipoprotein receptor‐related protein 4 (LRP4). 1 The bulk of generalized MG therapy include acetylcholinesterase inhibitors for symptomatic management as well as immunotherapeutic agents to inhibit autoimmunity. Most patients with generalized MG require induction therapy with glucocorticosteroids (steroids), or intravenous immunoglobulin (IVIG), plasma exchange (PE) for severe cases. And immunosuppressants are frequently used for maintenance. A repertoire of classical immunosuppressants, azathioprine, cyclophosphamide, mycophenolate mofetil, and tacrolimus have also been adopted. 2 , 3 Some efficacy of an anti‐CD20 B‐cell depleting agent, rituximab, is demonstrated by sustained clinical improvement with prolonged time to relapse and reduce the need of other immunosuppressants. 4 , 5 , 6 , 7\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596532.8553293}