{"duration": 0.029982805252075195, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Hypokalemic paralysis, hypokalemia, hypomagnesemia, thiazide diuretics, alcohol abuse, anxiety, hypertension\\n\\n---\\n\\nArticle: TITLE: Cannabis-Related Diffuse Alveolar Hemorrhage in a 16-Year-Old Patient: A Case Report. ABSTRACT: Diffuse alveolar hemorrhage (DAH) is a clinical condition characterized by the rapid onset of dyspnea, hemoptysis and acute respiratory failure (ARF). It is commonly caused by autoimmune systemic vasculitis, pulmonary infections, drugs and tumors. Here, we report a case of DAH caused by frequent cannabis smoking. A 16-year old boy presented with hemoptysis, dyspnea and ARF soon after laparoscopic surgery for varicocele in general anesthesia. The suspected diagnosis of DAH emerged from the initial chest radiography, and it was then confirmed by CT scan findings and the bronchoalveolar lavage. His general conditions completely recovered after only 24 h of oxygen supplementation and after intravenous corticosteroid and antibiotic therapy. This is the first pediatric case of DAH related to smoking marijuana, even though the inhalational anesthetic agent sevoflurane might have also been involved in this pathogenesis. Other possible causes of DAH have been considered. Negative-pressure pulmonary edema could be ruled out because no clinical evidence of upper airway obstruction was observed during general anesthesia and throughout the surgery. In addition, a possible causative role of cannabis additives/contaminants could not be excluded. Given the high prevalence of cannabis smoking in young people and that DAH can be a complication in cannabis smokers, a careful history and high index of suspicion are recommended as part of the pre-operative assessment before these patients are proceeded to receive general anesthesia. TEXT: Background Diffuse alveolar hemorrhage (DAH) is a medical condition characterized by bleeding into the alveolar spaces of the lungs due to the disruption of the alveolar-capillary basement membrane. It manifests as rapid onset of dyspnea, hemoptysis and acute respiratory failure (ARF) (1). The etiology can vary from autoimmune systemic vasculitis to pulmonary infections, drugs, and tumors, which can lead to pulmonary capillaritis, bland pulmonary hemorrhage, or diffuse alveolar damage (2–4). In particular, a strong association between DAH and the use of recreational drugs, such as cocaine, amphetamine and crack, has been well-documented (5, 6). Regarding pot smoking and DAH, literature is very poor since only few cases in adult patients have been described so far (7–11). Nonetheless, the prevalence of this recreational drug is increasing worldwide, including Italy where the lifetime prevalence of cannabis use is 27% among adolescents aged 16 years old (12, 13). In this regard, Italy has experienced a boom in light cannabis smoking since Law No. 242 went into effect December 2016, legalizing hemp cultivation and commercialization but paradoxically not its consumption (14).\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596819.1767058}