{"duration": 0.37836194038391113, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Unusual Recurrence of Antituberculosis Drug-Induced Hepatotoxicity in Children: A Case Series. ABSTRACT: BACKGROUND Antituberculosis drug-induced hepatotoxicity (ADIH) is a possible adverse event of antitubercular treatment. There are still no official guidelines for ADIH management in children. Recurrent ADIH is infrequently reported. CASE REPORT In this article, we report 6 unusual cases of recurrent ADIH in children. Five children developed ADIH during the intensive phase. Streptomycin and ethambutol were given to those with tuberculosis meningitis, urinary tract tuberculosis, and one patient with pulmonary tuberculosis with HIV infection and cardiac comorbidities. Five patients experienced a second ADIH episode after reintroduction. One patient developed ADIH symptoms again before reaching a full dose of isoniazid. The patient with pulmonary tuberculosis, HIV infection, and dilated cardiomyopathy experienced secondary episodes of ADIH and received levofloxacin and ethambutol as additional drugs. CONCLUSIONS Recurrent ADIH is relatively uncommon in children but may be encountered in daily practice. Reintroduction of previous treatment regimens should be tailored individually. There is an urgent need for standardized guidelines for ADIH in children. TEXT: Background Antituberculosis drug-induced hepatotoxicity (ADIH) is a possible adverse event of antitubercular treatment (ATT) [1]. ADIH incidence in children varies between 3.5% and 15.2% [2–4]. There are still no guidelines for ADIH management for children. Moreover, ADIH recurrence after reintroduction of treatment is not commonly reported. We aimed to evaluate management of ADIH recurrence in our setting by reporting 6 unusual cases of children with recurrent ADIH. Case Reports Case 1 A 4-year-old boy with lung tuberculosis (TB) and viral encephalitis experienced ADIH 2 times during his treatment period. The second episode developed when he was on his seventh month’s treatment, after being successfully reintroduced to full-dose isoniazid (INH) and rifampicin (RIF). We stopped his ATT at that point. Two weeks later, his liver enzymes normalized. We observed clinical improvement, so ATT was discontinued. Case 2 An 18-month-old girl with pulmonary TB and congenital cytomegalovirus infection experienced a third ADIH episode when being reintroduced to full-dose INH after previously developing ADIH. We modified the treatment to anti-TB therapy with full-dose RIF monotherapy for 9 months. Clinical improvement was observed during followup. Case 3\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597119.3828652}