{"duration": 0.22989654541015625, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': 'Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let\\'s think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Compartment and Crush Syndromes After Sleep Deprivation and a Therapeutic Dose of Zolpidem. ABSTRACT: Despite extensive review in the literature, compartment syndrome and crush syndrome remain difficult to diagnose. Trauma, toxins and reperfusion have been associated with these syndromes. Cases involving alcohol and drug abuse have described patients \"found down\" compressing an extremity. We present a case of a registered nurse who developed compartment syndrome in multiple limbs due to prolonged sleep after sleep deprivation and zolpidem use. To our knowledge, this is the first case of compartment syndrome or crush syndrome to have occurred in the setting of zolpidem use. Sleep disruption in healthcare workers represents a public health issue with dangerous sequelae, both acute and chronic. TEXT: INTRODUCTION A shift worker is defined as “anyone who works extended-duration shifts and other variable and nonstandard hours … late into the night or very early in the morning.”1 Nurses and hospital staff implemented shift-based scheduling long ago. Emergency physicians (EP) adopted the practice early in the evolution of the specialty. Hospitals are non-stop businesses with high rates of error occurring at very high stakes. Hospital staff and physicians who work night shifts and swing shifts are subjected to circadian disruption that leads to fatigue, poor performance, and patient harm. Many shift workers find themselves unable to obtain satisfactory quality or quantity of sleep due to rotating schedules. Sleep deprivation has been shown to impair vigilance, cognition, memory and fine motor skills.2 Night shift work and subsequent circadian disturbance have independent deleterious effects on these parameters.2 Cognitive performance decline from sleep deprivation appears similar to alcohol intoxication, with 17 hours of wakefulness correlating to a blood alcohol concentration of 0.05% and 24 hours to 0.10%.3 Compartment syndrome refers to the pressure increase in a closed fascial space to the point of reduced capillary perfusion.4 Usually due to long bone fracture, these pressure increases can ensue when a limb is crushed by a person’s own bodyweight. With severe or prolonged crushing force, muscle necrosis occurs with subsequent life-threatening systemic effects: rhabdomyolysis, renal failure, hyperkalemia, and death. We present the case of a registered nurse who used pharmaceuticals to “catch up” on sleep, waking up 30 hours later with crush and compartment syndromes in multiple limbs. CASE REPORT An African-American female in her early thirties with normal body mass index and no past medical history sought rest after 30 hours without sleep. The patient took 50 milligrams (mg) of diphenhydramine and five mg of immediate-release zolpidem. She awoke unable to move her right upper and lower extremities and had severe pain in the right side of her body. The patient contacted staff in her emergency department (ED) and was encouraged to call emergency medical services for transport to the hospital.\\nReasoning: Let\\'s think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Compartment syndrome, crush syndrome, sleep deprivation, zolpidem, diphenhydramine\\n\\n---\\n\\nArticle: TITLE: Survival and relative dose intensity of 5-fluorouracil, oxaliplatin and irinotecan in real-life treatment of metastatic colorectal cancer. ABSTRACT: Combinations of 5-fluorouracil/leucovorin (5-FU/LV) with oxaliplatin (FOLFOX) or irinotecan (FOLFIRI) are part of standard treatments for metastatic colorectal cancer (mCRC). For these molecules, the impact of a low relative dose intensity (RDI) on survival is not sufficiently known in real-life. Data were collected retrospectively from patients treated in our center for an unresectable mCRC with FOLFOX or FOLFIRI as a first-line treatment. To study the impact on progression-free survival (PFS) and overall survival (OS), patients were divided into high and low RDI according to the median RDI of 5-FU on one end, and the median RDI of oxaliplatin or irinotecan (OXA-IRI) on the other. In our population of 75 patients, the median age was 67.1 years and 77% of patients were treated with FOLFIRI. Patients with high RDI for OXA-IRI had better PFS compared to patients with low RDI (hazard ratio [HR], 0.58; p = 0.03). There was no statistically significant difference in PFS for patients with high RDI for 5-FU (HR, 0.66; p = 0.09). No difference was found in overall survival according to the RDI of OXA-IRI (HR, 0.72; p = 0.18) or 5-FU (HR, 0.77; p = 0.29). RDI had no significant impact on toxicities. Our analysis suggests that a low RDI of oxaliplatin and irinotecan has a negative effect on PFS. RDI had no significant effect on OS in our cohort. The clinical benefit of maintaining high RDI in these patients appears low. TEXT: Introduction In metastatic colorectal cancer (mCRC) with unresectable metastases, the combination of 5-fluorouracil/leucovorin (5-FU/LV) with oxaliplatin (FOLFOX regimen) or irinotecan (FOLFIRI regimen) is part of the first-line standard treatment that improved patient survival when compared to 5-FU/LV administered alone [1–4]. The use of monoclonal antibodies against VEGF and EGFR has also proved beneficial in this situation [5]. These treatments are intended to be administered at a certain dose and regimen. However, due to the onset of toxicities, it is common in clinical practice to make dose reductions or delay the administration of these molecules, which has the consequence of decreasing the relative dose intensity (RDI) [6, 7]. In many cancers, low chemotherapy RDI is associated with decreased disease control and survival [8–11]. With regard to mCRC, certain retrospective analyses of patients treated with FOLFOX or FOLFIRI have highlighted a link between survival and RDI of oxaliplatin and irinotecan [12, 13]. For 5-FU, one study has shown a possible link between RDI and response rate [14]; however, these results were not confirmed in a second trial when 5-FU was combined with LV [15]. In these studies, data resulted from clinical trials. As far as is known, in real-life, no study has shown a negative impact on survival of a low RDI of oxaliplatin, irinotecan or 5-FU in patients treated with FOLFOX or FOLFIRI [16, 17].\\nReasoning: Let\\'s think step by step in order to', 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596643.1422873}