{"duration": 0.017846345901489258, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Nivolumab-induced Vogt-Koyanagi-Harada-like Syndrome and Adrenocortical Insufficiency with Long-term Survival in a Patient with Non-small-cell Lung Cancer. ABSTRACT: A 58-year-old man was diagnosed with lung adenocarcinoma with a tumor proportion score of 10%. After six cycles of second-line chemotherapy with nivolumab, he achieved a complete response (CR) but developed uveitis and sensorineural hearing disorder, which were consistent with Vogt-Koyanagi-Harada (VKH)-like syndrome. Simultaneously, pituitary adrenocortical insufficiency was identified. Nivolumab discontinuation and systemic corticosteroid administration resolved these immune-related adverse events (irAEs). The patient has maintained a CR without any chemotherapy for approximately two years. We herein report a patient with a long-term progression-free survival despite chemotherapy discontinuation due to irAEs, including VKH-like syndrome, which were appropriately managed. TEXT: pmcIntroduction The advent of immune checkpoint inhibitors, such as nivolumab and pembrolizumab [anti-programmed cell death protein 1 (PD-1) antibodies] and ipilimumab [anti-cytotoxic T-lymphocyte-associated protein 4 (CTLA-4) antibody], has revolutionized the treatment of cancers including malignant melanoma, non-small-cell lung cancer, renal cell carcinoma, microsatellite instability-high carcinoma, and Hodgkin lymphoma (1-3). In addition to monotherapy, combination chemotherapy has successfully improved the survival rate of patients with lung cancer. However, immune checkpoint inhibitors have unique side effects, called immune-related adverse events (irAEs), which can occur in all body organs. IrAEs occur in 70-80% of patients receiving anti-PD-1 antibodies and in up to 90% of patients receiving anti-CTLA-4 antibodies (4-6). IrAEs often lead to treatment discontinuation; therefore, appropriate management of these adverse events is important. Vogt-Koyanagi-Harada (VKH) disease is a multisystem autoimmune disease with multiple clinical manifestations that can occur in the eyes, inner ear, central nervous system, hair, and skin melanocytes. Immune checkpoint inhibitors have been reported to cause VKH-like syndrome in rare cases. We herein report a patient with lung cancer who developed various irAEs, including VKH-like syndrome, and maintained a long-term complete response (CR) without chemotherapy, even after drug discontinuation. Case Report A 58-year-old man visited our hospital with a right femoral fracture. Computed tomography (CT) showed a 36-mm-diameter mass on the middle lobe of the right lung and multiple bone metastases to the sternum, pelvis, and right femur. The patient underwent open reduction and internal fixation of the right femoral fracture. A histological examination of the femoral bone revealed lung adenocarcinoma. The clinical stage was cT3N2M1c, stage IVB (7), with the patient testing negative for EGFR, ALK, ROS-1, and BRAF V600E mutations. His PD-L1 tumor proportion score (TPS) was 10%.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597084.4427514}