{"duration": 0.1340494155883789, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Acute pharmacogenetic dystonic reactions in a family with the CYP2D6 *41 allele: a case report. ABSTRACT: BACKGROUND Dystonia is a known neurological complication of certain medications; however, the mechanism behind such effects is often undetermined. Similarly, the clinical pharmacogenomic effects associated with various alleles of the cytochrome P450 family of proteins, and their role in acute dystonic reactions, are also presently unknown. METHODS We describe a woman presenting with acute dystonic reactions to ondansetron, prochlorperazine, and metoclopramide followed by persistent focal dystonia. A similar family history was reported in her siblings and her father to prochlorperazine, drugs all metabolized by the cytochrome P450 2D6 (CYP2D6) enzyme. Pharmacogenomic testing indicated the patient was heterozygous for the intermediate metabolizer *41 allele (CYP2D6 2988G>A, NM_000106.6:c.985+39G>A, rs28371725). Her father was homozygous for this CYP2D6 *41 allele, and consequently, her siblings were obligate carriers. CONCLUSIONS The metabolism of ondansetron, metoclopramide, or prochlorperazine in patients with the *41 CYP2D6 allele has not been studied. In this family, clinical evidence implicates the *41 CYP2D6 allele as causing extrapyramidal adverse pharmacologic reactions. Patients with a family history of medication-induced dystonia involving these medications should be considered for pharmacogenomic testing, and patients carrying the *41 CYP2D6 allele should consider reduction or avoidance of CYP2D6-mediated medications to minimize the potential risk of adverse extrapyramidal effects. TEXT: Background Acute dystonia, a disorder of abnormal muscle tone leading to spasms and/or abnormal posture, can occur after exposure to certain medications, typically dopamine receptor antagonists [1]. Symptoms can appear following the initial dose, can be focal, segmental, or generalized, and often involve the ocular muscles, face, jaw, neck, tongue, and trunk [1]. In severe cases, this can be life threatening. The mechanism behind these effects is not fully understood but, in some cases, may be precipitated by impairments in drug metabolism, such as by the cytochrome P450 family of proteins. However, the full clinical spectrum of pharmacogenomic effects associated with various alleles of the cytochrome P450 proteins, and their contribution to complications such as dystonia, is also presently unknown. Case presentation\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597152.1347215}