{"duration": 0.06638336181640625, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Hypokalemic paralysis, hypokalemia, hypomagnesemia, thiazide diuretics, alcohol abuse, anxiety, hypertension\\n\\n---\\n\\nArticle: TITLE: EBV-associated recurrent Hodgkin's disease after renal transplantation. ABSTRACT: Hodgkin's disease is recognized as part of the spectrum of post-transplantation lymphoproliferative disorders (PTLD), although it is still an uncommon de novo malignancy in this population. Epstein-Barr virus (EBV) has been linked to both post-transplant non-Hodgkin's lymphomas and Hodgkin's disease. We report a case of recurrent Hodgkin's disease in a patient who received a renal transplant in childhood and later developed EBV-associated Hodgkin's disease with remission after chemotherapy until subsequent relapse 9 years later that was successfully treated. To our knowledge, this is the first report of recurrent Hodgkin's disease in a transplant recipient. We briefly discuss the pathogenesis of and risk factors for EBV-related PTLD, utility of EBV load surveillance, and the options for treatment of PTLD including immunosuppression reduction, antiviral therapy, anti-CD20 monoclonal antibodies, cytotoxic T cells, and the possible roles of interferon-alpha and rapamycin. TEXT: Case report The patient is a 27-year-old white man who received a living-related donor transplant from his father at 11 years of age in 1986 for end stage renal disease secondary to posterior urethral valves. The patient was seronegative for cytomegalovirus (CMV) and Epstein–Barr virus (EBV) prior to transplantation. His father's EBV and CMV status were unavailable. The transplant course was complicated by immediate postoperative acute renal artery thrombosis, which required transplant nephrectomy. He then received a deceased donor renal transplant 10 days later. Maintenance immunosuppression consisted of cyclosporine (Sandimmune formulation), azathioprine, and prednisone. He received 12 doses of Minnesota equine antilymphocyte immunoglobulin (MALG) for induction followed by 10 doses of murine anti-CD3 monoclonal antibody (OKT3) for two episodes of acute graft rejection over the 7 weeks following the transplant. The deceased donor's EBV and CMV status were unavailable from medical records. The patient developed acute infectious mononucleosis 2 months after transplantation demonstrated by positive EBV serology. He was treated with acyclovir and the infectious mononucleosis resolved. At the age of 18, he presented with 5 months of fever, weight-loss and night sweats, and was found to have axillary adenopathy, splenomegaly and bulky right mediastinal adenopathy. A right anterior, thoracotomy and lymph node biopsy demonstrated Hodgkin's disease, nodular sclerosing subtype. Hodgkin's–Reed–Sternberg (HRS) cells were strongly positive for CD30 and EBV-latent membrane protein (LMP)-1. He was staged as Hodgkin's disease-IIIB. His EBV serology demonstrated elevated antiviral capsid antigen (VCA) IgG titers and positive anti-VCA IgM, consistent with reactivation of EBV infection.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596810.4086175}