{"duration": 0.012915849685668945, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: Fungal infection involvement in primary biliary cirrhosis: A review of 2 cases. ABSTRACT: The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in primary biliary cirrhosis (PBC) by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC. Both patients were female. One patient had a confirmed diagnosis of PBC. The other patient had confirmed Sjogren syndrome and PBC. The two cases of PBC were infected with fungal infection after treatment with hormonal and immunosuppressive agents. RCR of sputum confirmed Pneumocystis spp. infection in the patient with PBC alone. The mucormycosis infection was confirmed in the other patient after pathological examination of a renal biopsy. The state of the illnesses progressed quickly and both patients ultimately succumbed to their conditions. The patient prognosis of fungal infection involvement PBC is poor. Patients treated with long-term hormone and immunosuppressive agents should be monitored. TEXT: Introduction Fungal infection has rarely been reported in patients with primary biliary cirrhosis (PBC); however it may occur following live transplant (LT) in patients with PBC, predisposing factors for the development of fungal infection following LT include diabetes mellitus, cholestasis, hypertransfusion, acute rejection, treatment with high-dose of steroids and immunosuppressive agents, renal failure and bacterial infection (1). The present study aimed to analyze the imaging, clinical and pathological features of fungal infection involvement in PBC by retrospectively analyzing and reviewing the features of two patients with fungal infection involvement in PBC who were admitted to our department. Case report Case 1\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Fungal infection, Pneumocystis spp. infection, mucormycosis infection, diabetes mellitus, cholestasis, hypertransfusion, acute rejection, high-dose steroids, immunosuppressive agents, renal failure, bacterial infection\\n\\n---\\n\\nArticle: TITLE: Unilateral abdominal clonic jerking as an epileptic phenomenon. ABSTRACT: Unilateral abdominal wall clonic seizures are a rare manifestation of epilepsy. We report three cases of focal aware seizures manifesting as unilateral abdominal clonic motor movements. Standard EEG for patients with focal motor abdominal seizures is often unrevealing, which can make the diagnosis difficult. We report the first case of intracranial EEG in the diagnosis of a patients with this type of semiology during a focal seizure. In the absence of an electroclinical seizure verified by video-EEG monitoring, caution should be made with the diagnosis. A careful history should be obtained to help differentiate between unilateral abdominal clonic jerking and other abdominal complaints. TEXT: pmcIntroduction Seizures presenting as unilateral abdominal wall clonic jerking have been reported infrequently in the literature. There are 20 cases published in the English literature, the majority of which were an expression of epilepsia partialis continua [1], [2], [3], [4], [5], [6], [7], [8], [9], [10], [11], [12], [13], [14], [15] (See Table 1).Table 1 Review of prior cases of abdominal motor seizures in the English literature. Reference (Year + First author) Age and Sex Seizure Type Seizure Description Neuroimaging Lesion Location Ictal EEG Interictal EEG Etiology Matsuo 1984 19-year-old-female Focal Motor Right abdominal wall spasms spreading occasionally to right thigh and rarely to right arm Left parietal – “Slow waves over the left posterior quadrant…reactive to eye opening and closure.” No epileptiform activity Aspergilloma Matsuo 1984 66-year-old-female Focal Motor Left lower quadrant abdominal spasms with post-ictal hemiparesis Right parietal – “Amplitude asymmetry of the alpha rhythm, right greater than left… in light sleep…low voltage slow waves, involving primarily the right hemisphere.” No epileptiform activity. Meningioma Matsuo 1984 42-year-old male Focal Motor Right abdominal wall contractions at times spreading to right shoulder and face – No epileptiform discharges but “postictally low voltage focal slow waves…over the left parietal area” – Unknown Rosenbaum 1990 65-year-old-male Focal Motor Status Epilepticus Initially left hemiparesis followed by clonic left-sided abdominal jerking; recurrent seizures also involved left sided limbs and left face Right frontoparietal “Continuous quasiperiodic bursts of high-voltage delta- and sharp-wave complexes of 1.5 to 2.5 seconds originating from the right centroparietal area” – Brain Metastases Chalk 1991 66-year-old male Focal Motor Status Epilepticus Short episodes of brief and rhythmic contractions of the left abdominal muscles occurring at 2 to 3 Hz Right parasagittal “Right parasagittal periodic sharp wave discharges” – Cryptococcal Meningitis\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706597180.780756}