{"duration": 0.03149819374084473, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first look for any mention of medication in the article. Then, we will check for any symptoms or conditions that could be caused by the medication. Finally, we will confirm with the article if the medication was the cause of the symptoms.\\nReactions: hypokalemia, hypomagnesemia, pseudo-prolonged QT interval, ST depression, T-U wave fusion, QU interval, absent T wave\\n\\n---\\n\\nArticle: TITLE: Irreversible metronidazole encephalopathy in an elderly woman with primary biliary cholangitis. ABSTRACT: An 82-year-old woman with primary biliary cholangitis was diagnosed with an irreversible neurological disorder, caused by metronidazole (MNZ)-induced encephalopathy. Although the disorder is a reversible pathological condition, in rare cases, it can cause serious sequelae or could even be fatal. Therefore, medications should be administered carefully, particularly in patients who require long-term administration of large doses or those with liver dysfunction. TEXT: 1 INTRODUCTION Metronidazole (MNZ) is used as a first‐line treatment for Clostridium difficile (CD) colitis. MNZ‐induced encephalopathy is a relatively rare disease, characterized by a reversible central nervous system disorder. Generally, it is thought that the illness improves upon discontinuing medication. However, a few cases of serious residual sequelae and death have been reported, albeit in small numbers. Similarly, we have found serious residual sequelae caused by MNZ‐induced encephalopathy, as reported in this study. 2 CASE PRESENTATION An 82‐year‐old woman was admitted to our hospital complaining of fevers and nausea for one month. Upon experiencing these symptoms, she consulted her previous doctor, which led to her being diagnosed with pyelonephritis. Levofloxacin was prescribed, and her symptoms improved. However, 14 days prior to hospitalization, she once again started suffering from fevers, as well as passing mushy stool. The previous doctor prescribed MNZ based on a diagnosis of CD enteritis, confirmed by a positive CD toxin test. Consequently, the fever declined; however, the persistent nausea and vomiting led to the hospitalization of the patient. She has a past medical history of primary biliary cholangitis, atrial fibrillation, and interstitial pneumonia. She was taking branched‐chain amino acid, ursodeoxycholic acid, kanamycin, spironolactone, lactulose, and apixaban. On physical examination, vital signs were as follows: JCS (Japan coma scale), 0; GCS (Glasgow Coma Scale), 4/5/6; blood pressure, 130/64 mmHg; pulse rate, 68 beats/minute and regular; body temperature, 36.8°C; peripheral capillary oxygen saturation (SpO2), 95% (O2 at 2 L/min); no neurological abnormality. Laboratory examinations revealed the following: Blood test: blood urea nitrogen (BUN) 23 mg/dL. Urinalysis: white blood cells 2+, nitrate +, protein 2+. There were no other significant findings.\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596384.8924}