{"duration": 0.04254913330078125, "input_args": {"url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': \"Given a snippet from a medical article, identify the adverse drug reactions affecting the patient. Always return reactions.\\n\\n---\\n\\nFollow the following format.\\n\\nArticle: ${text}\\nReasoning: Let's think step by step in order to ${produce the output}. We ...\\nReactions: list of comma-separated adverse drug reactions\\n\\n---\\n\\nArticle: TITLE: A Case of Thiazide-induced Hypokalemic Paralysis. ABSTRACT: We describe the case of a patient presenting with odd neurologic symptoms initially thought to represent somatization who was found to have critical hypokalemia manifesting as hypokalemic non-periodic paralysis. It was determined that the patient had baseline hypokalemia as a function of alcohol abuse, exacerbated by self overmedication with hydrochlorothiazide for elevated blood pressure readings at home. The diagnosis was suspected when an electrocardiogram was obtained demonstrating a pseudo-prolonged QT interval with ST depression, consistent with T-U wave fusion and a QU interval with an absent T wave.1 The patient received oral and intravenous potassium and magnesium supplementation with resolution of symptoms. TEXT: INTRODUCTION We report a rare and unusual case of hypokalemic non-periodic paralysis (HNPP) precipitated by thiazide diuretic overuse in the setting of alcoholic malnutrition. HNPP associated with thiazide diuretics is extremely rare and reported only sparingly in the literature. Unique features of this case include the patient’s non-specific presentation, pathognomonic electrocardiogram (ECG) changes, and the severity of the patient’s hypokalemia and associated hypomagnesemia. The patient had complete resolution of symptoms with electrolyte repletion in the emergency department (ED). We discuss the incidence and mechanism of hypokalemic paralysis and a detailed description of the patient’s presentation as a reminder for emergency physicians to consider HNPP in the differential diagnosis of patients treated with thiazide diuretics presenting with neurologic symptoms. CASE REPORT A 53-year old female with a history of alcohol abuse, anxiety, and hypertension presented to the ED with a chief complaint of “I think I’m having a stroke.” The patient reported inability to move her face or hands since awaking that morning, about 30 minutes prior to arrival. She was immediately assessed by physician and nursing staff after triage personnel initiated a rapid stroke evaluation. On physical exam, the patient held her mouth immobile and partly open, even while talking. On neurologic exam, the patient’s hands and wrists appeared to be flaccid, with wrists held in passive flexion. Passive range of motion of all extremities was normal with no spasticity. Muscle strength was assessed at 1/5 in wrist flexion and extension, and 4/5 throughout the remainder of the bilateral extremities. She was unable to comply with cerebellar testing due to weakness. There was no clonus. The rest of the physical exam was unremarkable, including vital signs, which demonstrated a heart rate of 96 beats per minute, blood pressure of 136/88 millimeters of mercury, respirations of 16 breaths per minute, and pulse oximetry of 99% on room air. The patient was afebrile with an oral temperature of 97.6 degrees Fahrenheit.\\nReasoning: Let's think step by step in order to identify the adverse drug reactions affecting the patient. We will first identify the patients mentioned in the article, then look for any treatments or medications they received, and finally determine if there were any adverse reactions reported.\\nReactions: Hypokalemic paralysis, hypokalemia, hypomagnesemia, thiazide diuretics, alcohol abuse, anxiety, hypertension\\n\\n---\\n\\nArticle: TITLE: Dexrazoxane for cardioprotection in older adults with acute myeloid leukemia. ABSTRACT: Anthracyclines constitute the backbone of intensive adult acute myeloid leukemia (AML) therapy. Cardiotoxicity is one of its most serious adverse effects, and its incidence increases with cumulative dose. Dexrazoxane is a cardioprotective agent used in conjunction with anthracycline therapy. There is limited data of its usage in adult AML patients. We report the outcomes of six older adults at high risk of anthracycline-induced cardiotoxicity who received dexrazoxane during induction/re-induction therapy. Five had preserved left-ventricular function while two proceeded onto stem-cell transplantation. Additional investigation of dexrazoxane in adult leukemia therapy is warranted, particularly in older patients at highest risk for cardiovascular mortality. TEXT: 1 Introduction Acute myeloid leukemia (AML) accounts for 80% of acute leukemia in adults with a median age at diagnosis of 65 years [1]. The standard upfront induction regimen for fit adult individuals remains “7+3”, consisting of 7 days of continuous infusion cytarabine and 3 days of an anthracycline, either daunorubicin or idarubicin [2]. Variations of induction and re-induction regimens in the refractory/relapsed disease setting often include either idarubicin or mitoxantrone in conjunction with high dose cytarabine and sometimes purine analogues. Medical comorbidities, specifically cardiovascular morbidity, have been shown to negatively impact the clinical outcomes of AML induction therapy in older adults. Cardiotoxicity constitutes the most frequently feared adverse event associated with the use of anthracyclines (>10%), and compromised cardiac function may compromise the use of potentially curative upfront and subsequent AML regimens in a patient's course. Prevention or mitigation of anthracycline-induced cardiotoxicity, particularly in older adults who constitute the majority of new AML diagnoses, is therefore an area of tremendous clinical relevance. Cardiotoxicity of anthracyclines is dose-dependent and can occur at any time in the treatment course with acute, subacute, and late-onset presentations. Clinical symptoms include arrhythmias, myopericarditis, cardiomyopathy, and congestive heart failure with reduced left ventricular ejection fraction (LVEF) [3], [4], [5]. For example, the incidence of cardiotoxic events with use of doxorubicin was less than 5% at a cumulative dose of 400 mg/m2, but increased in a dose-dependent manner to 16% at a cumulative dose of 500 mg/m2, 26% at 550 mg/m2, and 48% at 700 mg/m2\\nReasoning: Let's think step by step in order to\", 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 150, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ('\\n\\n',)}}}"}, "time": 1706596818.391822}